Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
// v10.0.0
// Default SSID: ESP32-HID
// Default Password: 12345678
// Default Setting:
// - USB Mode: USB-OTG (TinyUSB)
// - Upload Mode: UART0 / Hardware CDC
// - USB CDC On Boot: Disabled
// - USB Firmware MSC On Boot: Enabled (ESP32-S2/3 Only)
// - Erase All Before Sketch Upload: Enabled (Optinal)
// - Partition Scheme:
//  - 8M with spiffs (3MB APP/1.5MB SPIFFS) [Recommended] [Frimware Default]
//  - Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
//  - Huge APP (3MB No OTA/1MB SPIFFS)
// - Flash Size: (8 MB/64 Mb) [Recommended] [Frimware Default]
// Get Firmware Hash:
// - Windows:
//   - certutil -hashfile ESP32-HID-Web-Remote-Controller.ino.bin SHA256
// - Linux:
//   - shasum -a 256 ESP32-HID-Web-Remote-Controller.ino.bin
// - Python:
//   - python -c "import hashlib; print(hashlib.sha256(open('ESP32-HID-Web-Remote-Controller.ino.bin','rb').read()).hexdigest())"
#include <Arduino.h>
#include <WiFi.h>
#include <WebServer.h>
#include <DNSServer.h>
#include <WebSocketsServer.h>
#include <USB.h>
#include <USBHIDMouse.h>
#include <USBHIDKeyboard.h>
#include <USBHIDConsumerControl.h>
#include <Preferences.h>
#include <cstdarg>
#include <cstdio>
#include <cstring>
#include <HTTPClient.h>
#include <Update.h>
#include <WiFiClientSecure.h>
#include <mbedtls/sha256.h>
#include <ESPmDNS.h>
#include <esp_wifi.h>
#include <esp_sleep.h>
#include <esp_partition.h>
#include <esp_ota_ops.h>
#include <time.h>
#define CONSUMER_VOLUME_INCREMENT 0xE9
#define CONSUMER_VOLUME_DECREMENT 0xEA
#define CONSUMER_MUTE 0xE2
#define CONSUMER_CHANNEL_INCREMENT 0x9C
#define CONSUMER_CHANNEL_DECREMENT 0x9D
#define CONSUMER_POWER 0x30
#define CONSUMER_INPUT_MENU 0x40
#define CONSUMER_INPUT_SELECT 0x8A
#define CONSUMER_AV_LIST 0x183
#define CONSUMER_AC_BACK 0x224
#define CONSUMER_AC_EXIT 0x204
#define CONSUMER_HOME 0x223
#define CONSUMER_PLAY 0xB0
#define CONSUMER_PAUSE 0xB1
#define CONSUMER_STOP 0xB7
#define CONSUMER_FAST_FORWARD 0xB3
#define CONSUMER_REWIND 0xB4
#define CONSUMER_NEXT_TRACK 0xB5
#define CONSUMER_PREV_TRACK 0xB6
#define CONSUMER_RECORD 0xB2
#define CONSUMER_EJECT 0xB8
#define CONSUMER_MEDIA_SELECT 0x183
#define CONSUMER_AC_SEARCH 0x221
#define CONSUMER_AC_HOME 0x223
#define CONSUMER_AC_FORWARD 0x225
#define CONSUMER_AC_REFRESH 0x227
#define CONSUMER_AC_BOOKMARKS 0x22A
#define CONSUMER_AC_PROPERTIES 0x229
#define CONSUMER_RED 0x232
#define CONSUMER_GREEN 0x233
#define CONSUMER_YELLOW 0x234
#define CONSUMER_BLUE 0x235
#define CONSUMER_UP 0x9F
#define CONSUMER_DOWN 0x9E
#define CONSUMER_LEFT 0x9D
#define CONSUMER_RIGHT 0x9C
#define CONSUMER_OK 0x221
#define LOG_MSG_SIZE 512
#define LOG_LEVEL_SIZE 8
#define REQ_LIMIT_WINDOW 1000
#define MAX_REQS_PER_WINDOW 50
USBHIDMouse Mouse;
USBHIDKeyboard Keyboard;
USBHIDConsumerControl ConsumerControl;
void checkUpdateTask(void* parameter);
void otaSecureTask(void* parameter);
void startSecureOta(bool allowInsecure);
WebServer server(80);
DNSServer dnsServer;
WebSocketsServer webSocket(81);
Preferences preferences;
static const size_t MAX_WS_FRAME = 256;
static const unsigned long WS_RATE_WINDOW = 100;
static const uint16_t MAX_WS_FRAMES_PER_WINDOW = 20;
struct {
  unsigned long lastFrame[256];
  uint16_t frameCount[256];
} wsRateLimit;
const unsigned long RETRY_BACKOFF[] = { 5000UL, 10000UL, 20000UL, 30000UL };
const char* ap_ssid = "ESP32-HID";
const char* ap_password = "12345678";
float sensitivity = 2.0f;
int repeatInterval = 100;
bool legacyMode = false;
bool bootProtocolMode = false;
bool gyroEnabled = false;
bool ctrlSticky = false, altSticky = false, shiftSticky = false, winSticky = false;
uint8_t ctrlHeld = 0, altHeld = 0, shiftHeld = 0, winHeld = 0;
String sta_ssid, sta_ip, sta_status = "Disconnected", sta_error;
bool scanInProgress = false;
int sta_retry_count = 0;
volatile bool staSaveChannel = false;
const int MAX_RETRIES = 3;
const unsigned long CONNECT_TIMEOUT = 15000UL;
const unsigned long RETRY_INTERVAL = 5000UL;
unsigned long connectStartTime = 0, lastRetryTime = 0;
bool connecting = false, retryPending = false, staStarted = false;
String ntpServer1 = "pool.ntp.org";
String ntpServer2 = "time.google.com";
String ntpServer3 = "time.cloudflare.com";
String mdnsHostname = "esp32-hid";
String mdnsDomain = "local";
const char* DEFAULT_VER_URL = "https://github.com/Aminiow/ESP32-HID-Web-Remote-Controller/raw/refs/heads/main/version.txt";
const char* DEFAULT_BIN_URL = "https://github.com/Aminiow/ESP32-HID-Web-Remote-Controller/raw/refs/heads/main/firmware.bin";
#define FW_VERSION_STR "10.0.0"
String updateVersionUrl, updateBinUrl;
bool updateInProgress = false, updateAvailable = false;
String newVersion, newHash;
static const char* rootCACertificate =
  "-----BEGIN CERTIFICATE-----\n"
  "MIICOjCCAcGgAwIBAgIQQvLM2htpN0RfFf51KBC49DAKBggqhkjOPQQDAzBfMQsw\n"
  "CQYDVQQGEwJHQjEYMBYGA1UEChMPU2VjdGlnbyBMaW1pdGVkMTYwNAYDVQQDEy1T\n"
  "ZWN0aWdvIFB1YmxpYyBTZXJ2ZXIgQXV0aGVudGljYXRpb24gUm9vdCBFNDYwHhcN\n"
  "MjEwMzIyMDAwMDAwWhcNNDYwMzIxMjM1OTU5WjBfMQswCQYDVQQGEwJHQjEYMBYG\n"
  "A1UEChMPU2VjdGlnbyBMaW1pdGVkMTYwNAYDVQQDEy1TZWN0aWdvIFB1YmxpYyBT\n"
  "ZXJ2ZXIgQXV0aGVudGljYXRpb24gUm9vdCBFNDYwdjAQBgcqhkjOPQIBBgUrgQQA\n"
  "IgNiAAR2+pmpbiDt+dd34wc7qNs9Xzjoq1WmVk/WSOrsfy2qw7LFeeyZYX8QeccC\n"
  "WvkEN/U0NSt3zn8gj1KjAIns1aeibVvjS5KToID1AZTc8GgHHs3u/iVStSBDHBv+\n"
  "6xnOQ6OjQjBAMB0GA1UdDgQWBBTRItpMWfFLXyY4qp3W7usNw/upYTAOBgNVHQ8B\n"
  "Af8EBAMCAYYwDwYDVR0TAQH/BAUwAwEB/zAKBggqhkjOPQQDAwNnADBkAjAn7qRa\n"
  "qCG76UeXlImldCBteU/IvZNeWBj7LRoAasm4PdCkT0RHlAFWovgzJQxC36oCMB3q\n"
  "4S6ILuH5px0CMk7yn2xVdOOurvulGu7t0vzCAxHrRVxgED1cf5kDW21USAGKcw==\n"
  "-----END CERTIFICATE-----\n";
#define GITHUB_LEAF_FP "71f1077db377fd7b8d68380da66fa68238a303b2911bcb770b3b2a426693cf84"
#define ROOT_CA_FP "c90f26f0fb1b4018b22227519b5ca2b53e2ca5b3be5cf18efe1bef47380c5383"
bool otaRunning = false;
WiFiClient* sseClient = NULL;
String otaLog;
unsigned long otaStartTime = 0;
size_t otaWritten = 0;
size_t otaTotal = 0;
enum OtaMode { OTA_CA,
               OTA_FP,
               OTA_INSECURE };
int8_t txPower = 20;
bool powerSaveEnabled = true;
bool idleSleepActive = false;
unsigned long lastClientActivity = 0;
static bool uploadOk = false;
static String uploadMsg = "";
#define MAX_LOG_ENTRIES 200
struct LogEntry {
  unsigned long timestamp;
  char level[8];
  char message[LOG_MSG_SIZE];
};
