Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
struct {
  unsigned long lastRequest[256] = { 0 };
  uint16_t requestCount[256] = { 0 };
} rateLimit;
LogEntry logBuffer[MAX_LOG_ENTRIES];
int logHead = 0, logCount = 0;
void addLog(const char* level, const char* format, ...) {
  char msg[LOG_MSG_SIZE];
  va_list args;
  va_start(args, format);
  int written = vsnprintf(msg, sizeof(msg), format, args);
  va_end(args);
  if (written < 0 || written >= (int)sizeof(msg)) {
    Serial.printf("[%lu] [WARN] addLog truncated: needed %d bytes, buffer %zu\n",
                  millis(), written, sizeof(msg));
  }
  LogEntry* entry = &logBuffer[logHead];
  entry->timestamp = millis();
  strncpy(entry->level, level, sizeof(entry->level) - 1);
  entry->level[sizeof(entry->level) - 1] = '\0';
  strncpy(entry->message, msg, sizeof(entry->message) - 1);
  entry->message[sizeof(entry->message) - 1] = '\0';
  logHead = (logHead + 1) % MAX_LOG_ENTRIES;
  if (logCount < MAX_LOG_ENTRIES) logCount++;
  Serial.printf("[%lu] [%s] %s\n", millis(), level, msg);
}
#define LOG_INFO(...) addLog("INFO", __VA_ARGS__)
#define LOG_WARN(...) addLog("WARN", __VA_ARGS__)
#define LOG_ERROR(...) addLog("ERROR", __VA_ARGS__)
#define LOG_SUCCESS(...) addLog("SUCCESS", __VA_ARGS__)
int16_t clamp(int16_t v, int16_t minv, int16_t maxv) {
  if (v < minv) return minv;
  if (v > maxv) return maxv;
  return v;
}
String clientFingerprintHex(WiFiClientSecure& client) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  uint8_t sha[32];
  if (!client.getFingerprintSHA256(sha)) return "";
  char hex[65];
  for (int i = 0; i < 32; i++) sprintf(hex + i * 2, "%02x", sha[i]);
  hex[64] = '\0';
  return String(hex);
#else
  return client.getFingerprintSHA256();
#endif
}
inline uint16_t getClientRemotePort(WiFiClient& client) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return client.remotePort();
#else
  return client.getRemotePort();
#endif
}
bool isRtcSynced() {
  time_t now = time(nullptr);
  const time_t MIN_VALID_TIME = 1577836800;
  if (now < MIN_VALID_TIME) {
    LOG_WARN("RTC not synced: time=%ld (should be > %ld)", (long)now, (long)MIN_VALID_TIME);
    return false;
  }
  const time_t MAX_VALID_TIME = 4102444800LL;
  if ((long long)now > (long long)MAX_VALID_TIME) {
    LOG_ERROR("RTC time unreasonable: %ld", (long)now);
    return false;
  }
  return true;
}
String jsonEscape(const String& input) {
  String out;
  out.reserve(input.length() * 6 + 16);
  for (size_t i = 0; i < input.length(); ++i) {
    char c = input.charAt(i);
    switch (c) {
      case '\\': out += "\\\\"; break;
      case '"': out += "\\\""; break;
      case '\n': out += "\\n"; break;
      case '\r': out += "\\r"; break;
      case '\t': out += "\\t"; break;
      case '\b': out += "\\b"; break;
      case '\f': out += "\\f"; break;
      default:
        if ((uint8_t)c < 0x20) {
          char buf[7];
          snprintf(buf, sizeof(buf), "\\u%04x", (unsigned char)c);
          out += buf;
        } else {
          out += c;
        }
        break;
    }
  }
  return out;
}
inline bool effectiveCtrl() {
  return ctrlSticky || ctrlHeld > 0;
}
inline bool effectiveAlt() {
  return altSticky || altHeld > 0;
}
inline bool effectiveShift() {
  return shiftSticky || shiftHeld > 0;
}
inline bool effectiveWin() {
  return winSticky || winHeld > 0;
}
void applyModifiers() {
  if (effectiveCtrl()) Keyboard.press(KEY_LEFT_CTRL);
  else Keyboard.release(KEY_LEFT_CTRL);
  if (effectiveAlt()) Keyboard.press(KEY_LEFT_ALT);
  else Keyboard.release(KEY_LEFT_ALT);
  if (effectiveShift()) Keyboard.press(KEY_LEFT_SHIFT);
  else Keyboard.release(KEY_LEFT_SHIFT);
  if (effectiveWin()) Keyboard.press(KEY_LEFT_GUI);
  else Keyboard.release(KEY_LEFT_GUI);
}
void releaseMouseButtons() {
  Mouse.release(MOUSE_LEFT);
  Mouse.release(MOUSE_RIGHT);
  Mouse.release(MOUSE_MIDDLE);
  LOG_INFO("All mouse buttons released");
}
void releaseHeldKeys() {
  Keyboard.releaseAll();
  LOG_INFO("All held keyboard keys released");
}
void releaseAllModifiers() {
  ctrlSticky = altSticky = shiftSticky = winSticky = false;
  ctrlHeld = altHeld = shiftHeld = winHeld = 0;
  Keyboard.release(KEY_LEFT_CTRL);
  Keyboard.release(KEY_LEFT_ALT);
  Keyboard.release(KEY_LEFT_SHIFT);
  Keyboard.release(KEY_LEFT_GUI);
  LOG_INFO("All modifiers released");
}
inline bool isModifierCode(uint8_t code) {
  return code == KEY_LEFT_CTRL || code == KEY_LEFT_ALT || code == KEY_LEFT_SHIFT || code == KEY_LEFT_GUI;
}
void modifierHeldDown(uint8_t code) {
  if (code == KEY_LEFT_CTRL) {
    if (ctrlHeld < 255) ctrlHeld++;
  } else if (code == KEY_LEFT_ALT) {
    if (altHeld < 255) altHeld++;
  } else if (code == KEY_LEFT_SHIFT) {
    if (shiftHeld < 255) shiftHeld++;
  } else if (code == KEY_LEFT_GUI) {
    if (winHeld < 255) winHeld++;
  }
  applyModifiers();
}
void modifierHeldUp(uint8_t code) {
  if (code == KEY_LEFT_CTRL) {
    if (ctrlHeld > 0) ctrlHeld--;
  } else if (code == KEY_LEFT_ALT) {
    if (altHeld > 0) altHeld--;
  } else if (code == KEY_LEFT_SHIFT) {
    if (shiftHeld > 0) shiftHeld--;
  } else if (code == KEY_LEFT_GUI) {
    if (winHeld > 0) winHeld--;
  }
  applyModifiers();
}
bool toggleModifier(const String& mod) {
  if (mod == "CTRL") ctrlSticky = !ctrlSticky;
  else if (mod == "ALT") altSticky = !altSticky;
  else if (mod == "SHIFT") shiftSticky = !shiftSticky;
  else if (mod == "WIN") winSticky = !winSticky;
  else {
    LOG_WARN("Invalid modifier: %s", mod.c_str());
    return false;
  }
  applyModifiers();
  bool state = false;
  if (mod == "CTRL") state = ctrlSticky;
  else if (mod == "ALT") state = altSticky;
  else if (mod == "SHIFT") state = shiftSticky;
  else if (mod == "WIN") state = winSticky;
  LOG_INFO("Sticky modifier %s -> %d", mod.c_str(), state);
  return true;
}
void loadSettings() {
  preferences.begin("settings", true);
  sensitivity = preferences.getFloat("sens", 2.0f);
  repeatInterval = preferences.getInt("repeat", 100);
  legacyMode = preferences.getBool("legacy", false);
  bootProtocolMode = preferences.getBool("bootproto", false);
  gyroEnabled = preferences.getBool("gyro", false);
  txPower = preferences.getInt("txpwr", 20);
  powerSaveEnabled = preferences.getBool("psave", true);
  ntpServer1 = preferences.getString("ntp1", "pool.ntp.org");
  ntpServer2 = preferences.getString("ntp2", "time.google.com");
  ntpServer3 = preferences.getString("ntp3", "time.cloudflare.com");
  mdnsHostname = preferences.getString("mdnsName", "esp32-hid");
  mdnsDomain = preferences.getString("mdnsDom", "local");
  preferences.end();
  sensitivity = constrain(sensitivity, 0.1f, 10.0f);
  repeatInterval = constrain(repeatInterval, 20, 1000);
  txPower = constrain(txPower, 0, 20);
  LOG_INFO("Settings loaded: sens=%.1f, repeat=%d, legacy=%d, bootproto=%d, gyro=%d, txpwr=%d, psave=%d",
           sensitivity, repeatInterval, legacyMode, bootProtocolMode, gyroEnabled, txPower, powerSaveEnabled);
}
void saveSettings() {
  preferences.begin("settings", false);
  preferences.putFloat("sens", sensitivity);
  preferences.putInt("repeat", repeatInterval);
  preferences.putBool("legacy", legacyMode);
  preferences.putBool("bootproto", bootProtocolMode);
  preferences.putBool("gyro", gyroEnabled);
  preferences.putInt("txpwr", txPower);
  preferences.putBool("psave", powerSaveEnabled);
  preferences.putString("ntp1", ntpServer1);
  preferences.putString("ntp2", ntpServer2);
  preferences.putString("ntp3", ntpServer3);
  preferences.putString("mdnsName", mdnsHostname);
  preferences.putString("mdnsDom", mdnsDomain);
  preferences.end();
  LOG_INFO("Settings saved");
}
void applyTxPower() {
  int8_t val = txPower * 4;
  if (val > 84) val = 84;
  if (val < 0) val = 0;
  esp_wifi_set_max_tx_power(val);
  LOG_INFO("TX power set to %d dBm", txPower);
}
void applyPowerSave() {
  esp_wifi_set_ps(powerSaveEnabled ? WIFI_PS_MIN_MODEM : WIFI_PS_NONE);
  LOG_INFO("Wi‑Fi power save %s", powerSaveEnabled ? "enabled" : "disabled");
}
void loadUpdateUrls() {
  preferences.begin("updates", true);
  updateVersionUrl = preferences.getString("verUrl", DEFAULT_VER_URL);
  updateBinUrl = preferences.getString("binUrl", DEFAULT_BIN_URL);
  preferences.end();
}
void saveUpdateUrls(const String& verUrl, const String& binUrl) {
  preferences.begin("updates", false);
  preferences.putString("verUrl", verUrl);
  preferences.putString("binUrl", binUrl);
  preferences.end();
  updateVersionUrl = verUrl;
  updateBinUrl = binUrl;
  LOG_INFO("Update URLs saved");
}
bool fetchVersionInfo(const String& url, String& version, String& hash) {
  if (!isRtcSynced()) {
    LOG_WARN("TLS validation skipped: RTC not synced");
    return false;
  }
  const char* fps[] = { ROOT_CA_FP, GITHUB_LEAF_FP };
  const char* names[] = { "root CA", "github" };
  {
    WiFiClientSecure client;
    client.setCACert(rootCACertificate);
    client.setTimeout(5000);
    HTTPClient http;
    client.setHandshakeTimeout(30);
    client.setTimeout(15000);
    http.begin(client, url);
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.setTimeout(5000);
    int code = http.GET();
    if (code == HTTP_CODE_OK) {
      String payload = http.getString();
      http.end();
      int nl = payload.indexOf('\n');
      if (nl == -1) {
        version = payload;
        hash = "";
      } else {
        version = payload.substring(0, nl);
        hash = payload.substring(nl + 1);
      }
      version.trim();
      hash.trim();
      LOG_INFO("Version check: Root CA OK");
      return true;
    }
    LOG_WARN("Version check: Root CA failed (code %d)", code);
    http.end();
  }
  for (int i = 0; i < 2; i++) {
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(5000);
    HTTPClient http;
    client.setHandshakeTimeout(30);
    client.setTimeout(15000);
    http.begin(client, url);
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.setTimeout(5000);
    int code = http.GET();
    if (code == HTTP_CODE_OK) {
      String peerFp = clientFingerprintHex(client);
      peerFp.replace(":", "");
      peerFp.toLowerCase();
      peerFp.trim();
      peerFp.toLowerCase();
      if (!peerFp.equalsIgnoreCase(fps[i])) {
        LOG_WARN("Version check: fingerprint mismatch for %s (got %s)", names[i], peerFp.c_str());
        http.end();
        continue;
      }
      String payload = http.getString();
      http.end();
      if (payload.isEmpty()) {
        LOG_WARN("Empty payload");
        return false;
      }
      int nl = payload.indexOf('\n');
      if (nl == -1) {
        version = payload;
        hash = "";
      } else {
        version = payload.substring(0, nl);
        hash = payload.substring(nl + 1);
      }
      version.trim();
      hash.trim();
      LOG_INFO("Version check: fingerprint match (%s)", names[i]);
      return true;
    }
    LOG_WARN("Version check: fingerprint (%s) failed (code %d)", names[i], code);
    http.end();
  }
  LOG_ERROR("Version check: all methods failed");
  return false;
}
void checkAndUpdate() {
  if (updateInProgress || WiFi.status() != WL_CONNECTED) return;
  loadUpdateUrls();
  String remoteVersion, remoteHash;
  if (!fetchVersionInfo(updateVersionUrl, remoteVersion, remoteHash)) {
    LOG_WARN("Could not fetch version info");
    return;
  }
  if (remoteVersion == FW_VERSION_STR) {
    LOG_INFO("Firmware up to date (%s)", FW_VERSION_STR);
    updateAvailable = false;
    return;
  }
  updateAvailable = true;
  newVersion = remoteVersion;
  newHash = remoteHash;
  LOG_INFO("New version %s available", remoteVersion.c_str());
}
void handleSetNtp() {
  if (server.hasArg("s1")) ntpServer1 = server.arg("s1");
  if (server.hasArg("s2")) ntpServer2 = server.arg("s2");
  if (server.hasArg("s3")) ntpServer3 = server.arg("s3");
  saveSettings();
  configTime(0, 0, ntpServer1.c_str(), ntpServer2.c_str(), ntpServer3.c_str());
  server.send(200, "text/plain", "OK");
}
void handleSetMdns() {
  String name = server.arg("name");
  String dom = server.arg("domain");
  name.trim();
  dom.trim();
  if (name.isEmpty()) {
    server.send(400, "text/plain", "name required");
    return;
  }
  if (dom.isEmpty()) dom = "local";
  mdnsHostname = name;
  mdnsDomain = dom;
  saveSettings();
  MDNS.end();
  if (MDNS.begin(mdnsHostname.c_str())) {
    MDNS.addService("http", "tcp", 80);
  }
  server.send(200, "text/plain", "OK");
}
void handleGetSettings() {
  String j = "{";
  j += "\"sens\":" + String(sensitivity, 2);
  j += ",\"repeat\":" + String(repeatInterval);
  j += ",\"legacy\":" + String(legacyMode ? 1 : 0);
  j += ",\"bootproto\":" + String(bootProtocolMode ? 1 : 0);
  j += ",\"gyro\":" + String(gyroEnabled ? 1 : 0);
  j += ",\"txpwr\":" + String(txPower);
  j += ",\"psave\":" + String(powerSaveEnabled ? 1 : 0);
  j += ",\"ntp1\":\"" + jsonEscape(ntpServer1) + "\"";
  j += ",\"ntp2\":\"" + jsonEscape(ntpServer2) + "\"";
  j += ",\"ntp3\":\"" + jsonEscape(ntpServer3) + "\"";
  j += ",\"mdnsName\":\"" + jsonEscape(mdnsHostname) + "\"";
  j += ",\"mdnsDom\":\"" + jsonEscape(mdnsDomain) + "\"";
  j += "}";
  server.send(200, "application/json", j);
}
void handleSetUpdateUrls() {
  String ver = server.arg("ver"), bin = server.arg("bin");
  if (ver.isEmpty() || bin.isEmpty()) {
    server.send(400, "text/plain", "Missing parameters");
    return;
  }
  saveUpdateUrls(ver, bin);
  server.send(200, "text/plain", "OK");
}
static bool checkRunning = false;
void handleCheckUpdate() {
  if (checkRunning) {
    server.send(429, "text/plain", "Check already running");
    return;
  }
  checkRunning = true;
  server.send(200, "text/plain", "Check started");
  xTaskCreatePinnedToCore(checkUpdateTask, "urlCheck", 8192, NULL, 1, NULL,
                          CONFIG_ARDUINO_RUNNING_CORE);
}
void checkUpdateTask(void* parameter) {
  checkAndUpdate();
  checkRunning = false;
  vTaskDelete(NULL);
}
void handleUpdateStatus() {
  String json = "{";
  json += "\"available\":";
  json += updateAvailable ? "true" : "false";
  json += ",\"current\":\"";
  json += FW_VERSION_STR;
  json += "\"";
  json += ",\"new\":\"";
  json += newVersion;
  json += "\"";
  json += ",\"hash\":\"";
  json += newHash;
  json += "\"";
  json += ",\"inProgress\":";
  json += updateInProgress ? "true" : "false";
  json += ",\"otaRunning\":";
  json += otaRunning ? "true" : "false";
  json += "}";
  server.send(200, "application/json", json);
}
void handleTriggerUpdate() {
  if (!updateAvailable) {
    server.send(400, "text/plain", "No update available");
    return;
  }
  if (otaRunning || updateInProgress) {
    server.send(409, "text/plain", "Update already in progress");
    return;
  }
  server.send(200, "text/plain", "Update started (secure)");
  startSecureOta(false);
}
void handleUpload() {
  static size_t total = 0;
  static mbedtls_sha256_context sha256_ctx;
  static bool hashInitialized = false;
  static String expectedHash = "";
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    total = 0;
    hashInitialized = false;
    expectedHash = "";
    uploadOk = false;
    uploadMsg = "in progress";
    String provided = server.arg("hash");
    provided.trim();
    provided.toLowerCase();
    if (provided.length() == 64) {
      bool allHex = true;
      for (size_t i = 0; i < provided.length(); i++) {
        char c = provided.charAt(i);
        if (!((c >= '0' && c <= '9') || (c >= 'a' && c <= 'f'))) {
          allHex = false;
          break;
        }
      }
      if (allHex) expectedHash = provided;
    }
    if (expectedHash.isEmpty()) {
      LOG_WARN("Manual upload: no valid hash provided — integrity NOT verified");
    }
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      uploadMsg = String("Update.begin failed: ") + Update.errorString();
      LOG_ERROR("%s", uploadMsg.c_str());
      return;
    }
    mbedtls_sha256_init(&sha256_ctx);
    mbedtls_sha256_starts(&sha256_ctx, 0);
    hashInitialized = true;
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      LOG_ERROR("Update.write failed");
    }
    if (hashInitialized) {
      mbedtls_sha256_update(&sha256_ctx, upload.buf, upload.currentSize);
    }
    total += upload.currentSize;
  } else if (upload.status == UPLOAD_FILE_END) {
    if (hashInitialized) {
      uint8_t hash[32];
      char hex[65];
      mbedtls_sha256_finish(&sha256_ctx, hash);
      mbedtls_sha256_free(&sha256_ctx);
      for (int i = 0; i < 32; i++) {
        sprintf(hex + i * 2, "%02x", hash[i]);
      }
      String computedHash = String(hex);
      if (!expectedHash.isEmpty()) {
        if (computedHash != expectedHash) {
          Update.abort();
          uploadMsg = "❌ HASH MISMATCH - firmware rejected for security!";
          LOG_ERROR("Hash mismatch: got %s, expected %s",
                    computedHash.c_str(), expectedHash.c_str());
          return;
        }
        LOG_SUCCESS("✅ Hash verified: %s", computedHash.c_str());
      } else {
        LOG_WARN("⚠️ No hash supplied — computed SHA-256: %s", computedHash.c_str());
      }
    }
    if (Update.end()) {
      uploadOk = true;
      uploadMsg = String("Update success (") + total + " bytes). Rebooting...";
      LOG_SUCCESS("Firmware update successful!");
    } else {
      uploadMsg = String("Update.end failed: ") + Update.errorString();
      LOG_ERROR("%s", uploadMsg.c_str());
    }
  }
}
bool checkRateLimit(uint8_t clientId) {
  unsigned long now = millis();
  if (now - rateLimit.lastRequest[clientId] > REQ_LIMIT_WINDOW) {
    rateLimit.requestCount[clientId] = 0;
  }
  rateLimit.lastRequest[clientId] = now;
  return ++rateLimit.requestCount[clientId] <= MAX_REQS_PER_WINDOW;
}
void handleMove() {
  if (!checkRateLimit(getClientRemotePort(server.client()))) {
    server.send(429, "text/plain", "Rate limited");
    return;
  }
  int dx = clamp(server.arg("dx").toInt(), -127, 127);
  int dy = clamp(server.arg("dy").toInt(), -127, 127);
  Mouse.move(dx, dy, 0);
  server.send(200, "text/plain", "OK");
}
void handleClick() {
  String btn = server.arg("btn");
  if (btn == "right") {
    Mouse.click(MOUSE_RIGHT);
    LOG_INFO("Mouse click right");
  } else if (btn == "middle") {
    Mouse.click(MOUSE_MIDDLE);
    LOG_INFO("Mouse click middle");
  } else {
    Mouse.click(MOUSE_LEFT);
    LOG_INFO("Mouse click left");
  }
  server.send(200, "text/plain", "OK");
}
void handleDoubleClick() {
  String btn = server.arg("btn");
  if (btn == "right") {
    Mouse.click(MOUSE_RIGHT);
    delay(50);
    Mouse.click(MOUSE_RIGHT);
    LOG_INFO("Mouse double click right");
  } else {
    Mouse.click(MOUSE_LEFT);
    delay(50);
    Mouse.click(MOUSE_LEFT);
    LOG_INFO("Mouse double click left");
  }
  server.send(200, "text/plain", "OK");
}
void handleDown() {
  String btn = server.arg("btn");
  if (btn == "right") {
    Mouse.press(MOUSE_RIGHT);
    LOG_INFO("Mouse press right");
  } else if (btn == "middle") {
    Mouse.press(MOUSE_MIDDLE);
    LOG_INFO("Mouse press middle");
  } else {
    Mouse.press(MOUSE_LEFT);
    LOG_INFO("Mouse press left");
  }
  server.send(200, "text/plain", "OK");
}
void handleUp() {
  String btn = server.arg("btn");
  if (btn == "right") {
    Mouse.release(MOUSE_RIGHT);
    LOG_INFO("Mouse release right");
  } else if (btn == "middle") {
    Mouse.release(MOUSE_MIDDLE);
    LOG_INFO("Mouse release middle");
  } else {
    Mouse.release(MOUSE_LEFT);
    LOG_INFO("Mouse release left");
  }
  server.send(200, "text/plain", "OK");
}
void handleWheel() {
  int delta = clamp(server.arg("delta").toInt(), -127, 127);
  Mouse.move(0, 0, delta);
  LOG_INFO("Mouse wheel delta=%d", delta);
  server.send(200, "text/plain", "OK");
}
void handleSetSensitivity() {
  float val = server.arg("value").toFloat();
  sensitivity = constrain(val, 0.1f, 10.0f);
  saveSettings();
  LOG_INFO("Sensitivity set to %.1f", sensitivity);
  server.send(200, "text/plain", "OK");
}
void handleSetRepeatInterval() {
  int val = server.arg("value").toInt();
  repeatInterval = constrain(val, 20, 1000);
  saveSettings();
  LOG_INFO("Repeat interval set to %d ms", repeatInterval);
  server.send(200, "text/plain", "OK");
}
void handleSetLegacyMode() {
  legacyMode = server.arg("value").toInt() == 1;
  saveSettings();
  LOG_INFO("Legacy mode set to %d", legacyMode);
  server.send(200, "text/plain", "OK");
}
void handleSetBootProtocol() {
  bootProtocolMode = server.arg("value").toInt() == 1;
  saveSettings();
  LOG_INFO("Boot protocol mode set to %d", bootProtocolMode);
  server.send(200, "text/plain", "OK");
}
void handleSetGyro() {
  gyroEnabled = server.arg("value").toInt() == 1;
  saveSettings();
  LOG_INFO("Gyro mouse control set to %d", gyroEnabled);
  server.send(200, "text/plain", "OK");
}
void handleSetTxPower() {
  int val = server.arg("value").toInt();
  txPower = constrain(val, 0, 20);
  saveSettings();
  applyTxPower();
  LOG_INFO("TX power set to %d dBm", txPower);
  server.send(200, "text/plain", "OK");
}
void handleSetPowerSave() {
  powerSaveEnabled = server.arg("value").toInt() == 1;
  saveSettings();
  applyPowerSave();
  LOG_INFO("Power save set to %d", powerSaveEnabled);
  server.send(200, "text/plain", "OK");
}
void handleConsumer() {
  String key = server.arg("key");
  uint16_t usage = 0;
  if (key == "VOLUME_UP") usage = CONSUMER_VOLUME_INCREMENT;
  else if (key == "VOLUME_DOWN") usage = CONSUMER_VOLUME_DECREMENT;
  else if (key == "MUTE") usage = CONSUMER_MUTE;
  else if (key == "CHANNEL_UP") usage = CONSUMER_CHANNEL_INCREMENT;
  else if (key == "CHANNEL_DOWN") usage = CONSUMER_CHANNEL_DECREMENT;
  else if (key == "POWER") usage = CONSUMER_POWER;
  else if (key == "INPUT_MENU") usage = CONSUMER_INPUT_MENU;
  else if (key == "INPUT_SELECT") usage = CONSUMER_INPUT_SELECT;
  else if (key == "AV_LIST") usage = CONSUMER_AV_LIST;
  else if (key == "BACK") usage = CONSUMER_AC_BACK;
  else if (key == "EXIT") usage = CONSUMER_AC_EXIT;
  else if (key == "HOME") usage = CONSUMER_HOME;
  else if (key == "PLAY") usage = CONSUMER_PLAY;
  else if (key == "PAUSE") usage = CONSUMER_PAUSE;
  else if (key == "STOP") usage = CONSUMER_STOP;
  else if (key == "FAST_FORWARD") usage = CONSUMER_FAST_FORWARD;
  else if (key == "REWIND") usage = CONSUMER_REWIND;
  else if (key == "NEXT") usage = CONSUMER_NEXT_TRACK;
  else if (key == "PREV") usage = CONSUMER_PREV_TRACK;
  else if (key == "RECORD") usage = CONSUMER_RECORD;
  else if (key == "EJECT") usage = CONSUMER_EJECT;
  else if (key == "SEARCH") usage = CONSUMER_AC_SEARCH;
  else if (key == "INFO") usage = CONSUMER_AC_PROPERTIES;
  else if (key == "FAVORITES") usage = CONSUMER_AC_BOOKMARKS;
  else if (key == "RED") usage = CONSUMER_RED;
  else if (key == "GREEN") usage = CONSUMER_GREEN;
  else if (key == "YELLOW") usage = CONSUMER_YELLOW;
  else if (key == "BLUE") usage = CONSUMER_BLUE;
  else if (key == "UP") usage = CONSUMER_UP;
  else if (key == "DOWN") usage = CONSUMER_DOWN;
  else if (key == "LEFT") usage = CONSUMER_LEFT;
  else if (key == "RIGHT") usage = CONSUMER_RIGHT;
  else if (key == "OK") usage = CONSUMER_OK;
  else {
    LOG_WARN("Unknown consumer key: %s", key.c_str());
    server.send(400, "text/plain", "Invalid key");
    return;
  }
  ConsumerControl.press(usage);
  delay(20);
  ConsumerControl.release();
  LOG_INFO("Consumer: %s", key.c_str());
  server.send(200, "text/plain", "OK");
}
void handleType() {
  String text = server.arg("text");
  String asciiText;
  asciiText.reserve(text.length());
  for (size_t i = 0; i < text.length(); i++) {
    char c = text.charAt(i);
    if (c >= 32 && c <= 126) asciiText += c;
  }
  LOG_INFO("Typing text: %s", asciiText.c_str());
  applyModifiers();
  for (size_t i = 0; i < asciiText.length(); i++) {
    char c = asciiText.charAt(i);
    Keyboard.press((uint8_t)c);
    delay(legacyMode ? 10 : 5);
    Keyboard.release((uint8_t)c);
    if (bootProtocolMode) {
      Keyboard.releaseAll();
      delay(5);
    }
    if (!legacyMode) delay(5);
  }
  server.send(200, "text/plain", "OK");
}
void handleKeyTap() {
  String key = server.arg("key");
