Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
  uint8_t code = keyNameToCode(key);
  if (code != 0) {
    sendKeyTap(code);
    LOG_INFO("Key tap request: %s (0x%02X)", key.c_str(), code);
  } else LOG_WARN("Unknown key: %s", key.c_str());
  server.send(200, "text/plain", "OK");
}
void handleKeyDown() {
  String key = server.arg("key");
  uint8_t code = keyNameToCode(key);
  if (code == 0) {
    LOG_WARN("Unknown key down: %s", key.c_str());
    server.send(200, "text/plain", "OK");
    return;
  }
  if (isModifierCode(code)) modifierHeldDown(code);
  else {
    applyModifiers();
    Keyboard.press(code);
  }
  LOG_INFO("Key down: %s (0x%02X)", key.c_str(), code);
  server.send(200, "text/plain", "OK");
}
void handleKeyUp() {
  String key = server.arg("key");
  uint8_t code = keyNameToCode(key);
  if (code == 0) {
    LOG_WARN("Unknown key up: %s", key.c_str());
    server.send(200, "text/plain", "OK");
    return;
  }
  if (isModifierCode(code)) modifierHeldUp(code);
  else {
    Keyboard.release(code);
    applyModifiers();
  }
  LOG_INFO("Key up: %s (0x%02X)", key.c_str(), code);
  server.send(200, "text/plain", "OK");
}
void handleToggleModifier() {
  String mod = server.arg("mod");
  if (!toggleModifier(mod)) {
    server.send(400, "text/plain", "Invalid modifier");
    return;
  }
  server.send(200, "text/plain", "OK");
}
void handleResetModifiers() {
  releaseAllModifiers();
  server.send(200, "text/plain", "OK");
}
void setSTAErrorFromStatus() {
  wl_status_t status = WiFi.status();
  switch (status) {
    case WL_NO_SSID_AVAIL: sta_error = "SSID not found"; break;
    case WL_CONNECT_FAILED: sta_error = "Connection failed"; break;
#ifdef WL_WRONG_PASSWORD
    case WL_WRONG_PASSWORD: sta_error = "Wrong password"; break;
#endif
    case WL_IDLE_STATUS: sta_error = "Idle"; break;
    case WL_DISCONNECTED: sta_error = "Disconnected"; break;
#ifdef WL_CONNECTION_LOST
    case WL_CONNECTION_LOST: sta_error = "Connection lost"; break;
#endif
    default: sta_error = "Unknown error"; break;
  }
}
void updateSTAStatus(bool logStatus = false) {
  if (WiFi.status() == WL_CONNECTED) {
    String currentIP = WiFi.localIP().toString();
    String currentSSID = WiFi.SSID();
    bool changed = sta_status != "Connected" || sta_ip != currentIP || sta_ssid != currentSSID;
    sta_status = "Connected";
    sta_ip = currentIP;
    sta_ssid = currentSSID;
    sta_error = "";
    connecting = false;
    retryPending = false;
    sta_retry_count = 0;
    if (logStatus || changed) LOG_SUCCESS("STA connected to %s, IP %s", sta_ssid.c_str(), sta_ip.c_str());
    return;
  }
  sta_ip = "";
  sta_ssid = "";
  if (connecting) {
    sta_status = "Connecting...";
    setSTAErrorFromStatus();
    if (millis() - connectStartTime > CONNECT_TIMEOUT) sta_error = "Connection timeout";
  } else if (retryPending) {
    sta_status = "Retrying...";
    sta_error = "Retry scheduled";
  } else {
    sta_status = "Disconnected";
    setSTAErrorFromStatus();
  }
  if (logStatus) LOG_WARN("STA status: %s, error: %s", sta_status.c_str(), sta_error.c_str());
}
void WiFiEvent(WiFiEvent_t event) {
  switch (event) {
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      if (connecting) {
        sta_status = "Connecting...";
        sta_error = "Connected, waiting for IP...";
      }
      LOG_INFO("STA connected to AP, waiting for IP");
      break;
    case ARDUINO_EVENT_WIFI_STA_GOT_IP:
      {
        staSaveChannel = true;
        preferences.begin("wifi", false);
        preferences.putInt("lastChan", WiFi.channel());
        preferences.end();
        updateSTAStatus(true);
        break;
      }
    case ARDUINO_EVENT_WIFI_STA_DISCONNECTED:
      if (!retryPending) {
        if (connecting) sta_status = "Connecting...";
        else sta_status = "Disconnected";
        setSTAErrorFromStatus();
      }
      LOG_WARN("STA disconnected: %s", sta_error.c_str());
      break;
    default: break;
  }
}
bool parseBSSID(const String& text, uint8_t out[6]) {
  if (text.length() != 17) return false;
  unsigned int b[6];
  if (sscanf(text.c_str(), "%2x:%2x:%2x:%2x:%2x:%2x", &b[0], &b[1], &b[2], &b[3], &b[4], &b[5]) != 6) return false;
  for (int i = 0; i < 6; i++) {
    if (b[i] > 255) return false;
    out[i] = (uint8_t)b[i];
  }
  return true;
}
void connectSTA(String ssid, String password, bool hidden, String bssid_str, bool resetRetries) {
  if (ssid.isEmpty()) {
    LOG_ERROR("connectSTA: empty SSID");
    return;
  }
  if (WiFi.status() == WL_CONNECTED || connecting) return;
  if (resetRetries) {
    sta_retry_count = 0;
    retryPending = false;
  }
  if (WiFi.scanComplete() == WIFI_SCAN_RUNNING) {
    unsigned long t0 = millis();
    while (WiFi.scanComplete() == WIFI_SCAN_RUNNING && millis() - t0 < 6000) delay(50);
  }
  WiFi.scanDelete();
  scanInProgress = false;
  int targetChannel = 0;
  if (hidden && !bssid_str.isEmpty()) {
    uint8_t bssid[6];
    if (parseBSSID(bssid_str, bssid)) {
      int n = WiFi.scanNetworks(false, true);
      for (int i = 0; i < n; i++) {
        if (WiFi.BSSIDstr(i).equalsIgnoreCase(bssid_str)) {
          targetChannel = WiFi.channel(i);
          break;
        }
      }
      WiFi.scanDelete();
      LOG_INFO("Hidden net scan: channel=%d for BSSID=%s", targetChannel, bssid_str.c_str());
    }
  }
  WiFi.disconnect();
  delay(50);
  WiFi.mode(WIFI_AP_STA);
  WiFi.setAutoReconnect(false);
  preferences.begin("wifi", false);
  preferences.putString("ssid", ssid);
  preferences.putString("pass", password);
  preferences.putBool("hidden", hidden);
  preferences.putString("bssid", hidden ? bssid_str : "");
  preferences.putInt("chan", targetChannel);
  preferences.end();
  connecting = true;
  retryPending = false;
  connectStartTime = millis();
  lastRetryTime = millis();
  sta_error = "Connecting...";
  sta_status = "Connecting...";
  sta_ip = "";
  sta_ssid = "";
  LOG_INFO("Connecting STA: %s ch=%d hidden=%d bssid=%s attempt=%d",
           ssid.c_str(), targetChannel, hidden, bssid_str.c_str(), sta_retry_count + 1);
  if (targetChannel == 0 && hidden && !bssid_str.isEmpty()) {
    preferences.begin("wifi", true);
    int savedChan = preferences.getInt("lastChan", 0);
    preferences.end();
    targetChannel = savedChan > 0 ? savedChan : 6;
    LOG_WARN("Hidden net scan missed; trying ch=%d", targetChannel);
  }
  if (targetChannel > 0 && !bssid_str.isEmpty()) {
    uint8_t bssid[6];
    parseBSSID(bssid_str, bssid);
    LOG_INFO("connectSTA: using ch=%d hidden=%d bssid=%s", targetChannel, hidden, bssid_str.c_str());
    WiFi.begin(ssid.c_str(), password.c_str(), targetChannel, bssid, true);
  } else {
    LOG_INFO("connectSTA: using ch=%d hidden=%d bssid=%s", targetChannel, hidden, bssid_str.c_str());
    WiFi.begin(ssid.c_str(), password.c_str());
  }
}
void loadSTAConfig() {
  preferences.begin("wifi", true);
  String ssid = preferences.getString("ssid", "");
  String pass = preferences.getString("pass", "");
  bool hidden = preferences.getBool("hidden", false);
  String bssid = preferences.getString("bssid", "");
  preferences.end();
  if (!ssid.isEmpty()) {
    LOG_INFO("Loading saved STA config: %s", ssid.c_str());
    connectSTA(ssid, pass, hidden, bssid, true);
  } else LOG_INFO("No saved STA config found");
}
void disconnectSTA() {
  releaseAllModifiers();
  releaseMouseButtons();
  releaseHeldKeys();
  retryPending = false;
  connecting = false;
  sta_retry_count = 0;
  scanInProgress = false;
  if (WiFi.scanComplete() >= 0) WiFi.scanDelete();
  WiFi.disconnect();
  WiFi.mode(WIFI_AP);
  sta_status = "Disconnected";
  sta_ip = "";
  sta_ssid = "";
  sta_error = "Disconnected";
  LOG_INFO("STA disconnected manually");
}
void forgetSTA() {
  preferences.begin("wifi", false);
  preferences.clear();
  preferences.end();
  disconnectSTA();
  LOG_INFO("STA credentials forgotten");
}
void handleSTAStatus() {
  updateSTAStatus(false);
  String json = "{";
  json += "\"connected\":";
  json += (WiFi.status() == WL_CONNECTED ? "true" : "false");
  json += ",\"ssid\":\"";
  json += jsonEscape(sta_ssid);
  json += "\"";
  json += ",\"ip\":\"";
  json += jsonEscape(sta_ip);
  json += "\"";
  json += ",\"status\":\"";
  json += jsonEscape(sta_status);
  json += "\"";
  json += ",\"error\":\"";
  json += jsonEscape(sta_error);
  json += "\"";
  json += "}";
  server.send(200, "application/json", json);
}
void handleSTAScan() {
  if (connecting) {
    server.send(409, "application/json", "{\"error\":\"Cannot scan while connecting\"}");
    return;
  }
  int n = WiFi.scanComplete();
  if (n == WIFI_SCAN_RUNNING) {
    scanInProgress = true;
    server.send(200, "application/json", "{\"scanning\":true}");
    return;
  }
  if (n == WIFI_SCAN_FAILED) {
    if (scanInProgress) {
      scanInProgress = false;
      LOG_ERROR("WiFi scan failed");
      server.send(503, "application/json", "{\"error\":\"WiFi scan failed\"}");
      return;
    }
    WiFi.mode(WIFI_AP_STA);
    LOG_INFO("Starting WiFi scan...");
    scanInProgress = true;
    if (WiFi.scanNetworks(true, true) == WIFI_SCAN_FAILED) {
      scanInProgress = false;
      LOG_ERROR("Failed to start WiFi scan");
      server.send(503, "application/json", "{\"error\":\"WiFi scan failed to start\"}");
      return;
    }
    server.send(200, "application/json", "{\"scanning\":true}");
    return;
  }
  if (n >= 0) {
    String json = "[";
    json.reserve((size_t)n * 130 + 4);
    for (int i = 0; i < n; i++) {
      if (i > 0) json += ",";
      String ssid = WiFi.SSID(i);
      String bssid = WiFi.BSSIDstr(i);
      int rssi = WiFi.RSSI(i);
      wifi_auth_mode_t encryption = WiFi.encryptionType(i);
      String encType;
      switch (encryption) {
        case WIFI_AUTH_OPEN: encType = "Open"; break;
        case WIFI_AUTH_WEP: encType = "WEP"; break;
        case WIFI_AUTH_WPA_PSK: encType = "WPA"; break;
        case WIFI_AUTH_WPA2_PSK: encType = "WPA2"; break;
        case WIFI_AUTH_WPA_WPA2_PSK: encType = "WPA/WPA2"; break;
        case WIFI_AUTH_WPA2_ENTERPRISE: encType = "WPA2-Enterprise"; break;
#ifdef WIFI_AUTH_WPA3_PSK
        case WIFI_AUTH_WPA3_PSK: encType = "WPA3"; break;
#endif
#ifdef WIFI_AUTH_WPA2_WPA3_PSK
        case WIFI_AUTH_WPA2_WPA3_PSK: encType = "WPA2/WPA3"; break;
#endif
        default: encType = "Unknown"; break;
      }
      json += "{\"ssid\":\"";
      json += jsonEscape(ssid);
      json += "\",\"rssi\":";
      json += String(rssi);
      json += ",\"encryption\":";
      json += String((int)encryption);
      json += ",\"bssid\":\"";
      json += jsonEscape(bssid);
      json += "\",\"encryption_str\":\"";
      json += jsonEscape(encType);
      json += "\"}";
    }
    json += "]";
    LOG_INFO("WiFi scan completed, %d networks found", n);
    scanInProgress = false;
    WiFi.scanDelete();
    server.send(200, "application/json", json);
    return;
  }
  scanInProgress = false;
  LOG_ERROR("Unexpected WiFi scan state: %d", n);
  server.send(500, "application/json", "{\"error\":\"Unexpected scan state\"}");
}
void handleSTAConnect() {
  String ssid = server.arg("ssid");
  String password = server.arg("pass");
  bool hidden = server.arg("hidden") == "1" || server.arg("hidden") == "true";
  String bssid = server.arg("bssid");
  ssid.trim();
  bssid.trim();
  if (ssid.isEmpty()) {
    LOG_ERROR("STA connect called with empty SSID");
    server.send(400, "text/plain", "SSID required");
    return;
  }
  if (connecting || WiFi.status() == WL_CONNECTED) {
    server.send(409, "text/plain", "STA already connected or connecting");
    return;
  }
  if (hidden && !bssid.isEmpty()) {
    uint8_t temp[6];
    if (!parseBSSID(bssid, temp)) {
      server.send(400, "text/plain", "Invalid BSSID");
      return;
    }
  }
  LOG_INFO("STA connect request: ssid=%s, hidden=%d, bssid=%s", ssid.c_str(), hidden, bssid.c_str());
  connectSTA(ssid, password, hidden, bssid, true);
  server.send(200, "text/plain", "OK");
}
void handleSTADisconnect() {
  LOG_INFO("STA disconnect request");
  disconnectSTA();
  server.send(200, "text/plain", "OK");
}
void handleSTAForget() {
  LOG_INFO("STA forget request");
  forgetSTA();
  server.send(200, "text/plain", "OK");
}
void handleLogs() {
  String json = "[";
  int start = (logHead - logCount + MAX_LOG_ENTRIES) % MAX_LOG_ENTRIES;
  for (int i = 0; i < logCount; i++) {
    int idx = (start + i) % MAX_LOG_ENTRIES;
    if (i) json += ",";
    json += "{";
    json += "\"timestamp\":";
    json += String(logBuffer[idx].timestamp);
    json += ",\"level\":\"";
    json += jsonEscape(String(logBuffer[idx].level));
    json += "\"";
    json += ",\"message\":\"";
    json += jsonEscape(String(logBuffer[idx].message));
    json += "\"";
    json += "}";
  }
  json += "]";
  server.send(200, "application/json", json);
}
const uint8_t HID_KP_NUMLOCK = 0x53;
const uint8_t HID_KP_SLASH = 0x54;
const uint8_t HID_KP_STAR = 0x55;
const uint8_t HID_KP_MINUS = 0x56;
const uint8_t HID_KP_PLUS = 0x57;
const uint8_t HID_KP_ENTER = 0x58;
const uint8_t HID_KP_1 = 0x59;
const uint8_t HID_KP_2 = 0x5A;
const uint8_t HID_KP_3 = 0x5B;
const uint8_t HID_KP_4 = 0x5C;
const uint8_t HID_KP_5 = 0x5D;
const uint8_t HID_KP_6 = 0x5E;
const uint8_t HID_KP_7 = 0x5F;
const uint8_t HID_KP_8 = 0x60;
const uint8_t HID_KP_9 = 0x61;
const uint8_t HID_KP_0 = 0x62;
const uint8_t HID_KP_DOT = 0x63;
uint8_t keyNameToCode(const String& key) {
  String k = key;
  k.trim();
  k.toUpperCase();
  if (k == "ENTER") return KEY_RETURN;
  if (k == "BACKSPACE") return KEY_BACKSPACE;
  if (k == "TAB") return KEY_TAB;
  if (k == "SPACE") return ' ';
  if (k == "ESC") return KEY_ESC;
  if (k == "DELETE") return KEY_DELETE;
  if (k == "CAPSLOCK") return KEY_CAPS_LOCK;
  if (k == "UP") return KEY_UP_ARROW;
  if (k == "DOWN") return KEY_DOWN_ARROW;
  if (k == "LEFT") return KEY_LEFT_ARROW;
  if (k == "RIGHT") return KEY_RIGHT_ARROW;
  if (k == "HOME") return KEY_HOME;
  if (k == "END") return KEY_END;
  if (k == "PAGEUP") return KEY_PAGE_UP;
  if (k == "PAGEDOWN") return KEY_PAGE_DOWN;
  if (k == "INSERT") return KEY_INSERT;
  if (k == "F1") return KEY_F1;
  if (k == "F2") return KEY_F2;
  if (k == "F3") return KEY_F3;
  if (k == "F4") return KEY_F4;
  if (k == "F5") return KEY_F5;
  if (k == "F6") return KEY_F6;
  if (k == "F7") return KEY_F7;
  if (k == "F8") return KEY_F8;
  if (k == "F9") return KEY_F9;
  if (k == "F10") return KEY_F10;
  if (k == "F11") return KEY_F11;
  if (k == "F12") return KEY_F12;
  if (k == "PRTSC") return KEY_PRINT_SCREEN;
  if (k == "SCRLK") return KEY_SCROLL_LOCK;
  if (k == "PAUSE") return KEY_PAUSE;
  if (k == "NUMLOCK") return HID_KP_NUMLOCK;
  if (k == "MENU") return KEY_MENU;
  if (k == "WINDOWS") return KEY_LEFT_GUI;
  if (k == "CTRL") return KEY_LEFT_CTRL;
  if (k == "ALT") return KEY_LEFT_ALT;
  if (k == "SHIFT") return KEY_LEFT_SHIFT;
  if (k == "KP_SLASH") return HID_KP_SLASH;
  if (k == "KP_ASTERISK") return HID_KP_STAR;
  if (k == "KP_MINUS") return HID_KP_MINUS;
  if (k == "KP_PLUS") return HID_KP_PLUS;
  if (k == "KP_ENTER") return HID_KP_ENTER;
  if (k == "KP_0") return HID_KP_0;
  if (k == "KP_1") return HID_KP_1;
  if (k == "KP_2") return HID_KP_2;
  if (k == "KP_3") return HID_KP_3;
  if (k == "KP_4") return HID_KP_4;
  if (k == "KP_5") return HID_KP_5;
  if (k == "KP_6") return HID_KP_6;
  if (k == "KP_7") return HID_KP_7;
  if (k == "KP_8") return HID_KP_8;
  if (k == "KP_9") return HID_KP_9;
  if (k == "KP_DOT") return HID_KP_DOT;
  if (k.length() == 1) return (uint8_t)k.charAt(0);
  return 0;
}
void sendKeyTap(uint8_t keycode) {
  if (isModifierCode(keycode)) {
    modifierHeldDown(keycode);
    delay(legacyMode ? 40 : 20);
    modifierHeldUp(keycode);
  } else {
    applyModifiers();
    Keyboard.press(keycode);
    delay(legacyMode ? 40 : 20);
    Keyboard.release(keycode);
    if (bootProtocolMode) {
      Keyboard.releaseAll();
      delay(5);
    }
  }
  LOG_INFO("Key tap: 0x%02X", keycode);
}
void webSocketEvent(uint8_t num, WStype_t type, uint8_t* payload, size_t length) {
  if (type == WStype_TEXT) {
    if (length == 0 || length > MAX_WS_FRAME) {
      LOG_WARN("WebSocket frame invalid size: %zu bytes (limit %zu)", length, MAX_WS_FRAME);
      return;
    }
    unsigned long now = millis();
    if (now - wsRateLimit.lastFrame[num] > WS_RATE_WINDOW) {
      wsRateLimit.frameCount[num] = 0;
    }
    wsRateLimit.lastFrame[num] = now;
    if (++wsRateLimit.frameCount[num] > MAX_WS_FRAMES_PER_WINDOW) {
      LOG_WARN("WebSocket rate limit exceeded for client %u", num);
      return;
    }
    String msg;
    msg.reserve(length + 1);
    for (size_t i = 0; i < length; i++) {
      if (payload[i] >= 32 && payload[i] < 127) {
        msg += (char)payload[i];
      } else {
        LOG_WARN("WebSocket frame contains non-ASCII byte: 0x%02X", payload[i]);
        return;
      }
    }
    msg.trim();
    int dx = 0, dy = 0;
    if (sscanf(msg.c_str(), "{\"dx\":%d,\"dy\":%d}", &dx, &dy) == 2) {
      dx = clamp(dx, -127, 127);
      dy = clamp(dy, -127, 127);
      Mouse.move(dx, dy, 0);
      return;
    }
    int g = 0, gdx = 0, gdy = 0;
    if (sscanf(msg.c_str(), "{\"gyro\":%d,\"dx\":%d,\"dy\":%d}", &g, &gdx, &gdy) == 3) {
      gdx = clamp(gdx, -127, 127);
      gdy = clamp(gdy, -127, 127);
      Mouse.move(gdx, gdy, 0);
      return;
    }
    LOG_WARN("WebSocket unknown message format: %s", msg.c_str());
  } else if (type == WStype_CONNECTED) {
    LOG_INFO("WebSocket client connected, id=%u", num);
    wsRateLimit.lastFrame[num] = millis();
    wsRateLimit.frameCount[num] = 0;
  } else if (type == WStype_DISCONNECTED) {
    LOG_INFO("WebSocket client disconnected, id=%u", num);
    wsRateLimit.frameCount[num] = 0;
  }
}
int selectBestChannel() {
  WiFi.scanNetworks(true);
  int attempts = 0;
  while (WiFi.scanComplete() == WIFI_SCAN_RUNNING && attempts++ < 30) delay(100);
  int n = WiFi.scanComplete();
  if (n <= 0) {
    WiFi.scanDelete();
    return 1;
  }
  int channelCount[12] = { 0 };
  for (int i = 0; i < n; i++) {
    int ch = WiFi.channel(i);
    if (ch >= 1 && ch <= 11) channelCount[ch]++;
  }
  WiFi.scanDelete();
  int best = 1, minCount = channelCount[1];
  for (int ch = 2; ch <= 11; ch++) {
    if (channelCount[ch] < minCount) {
      minCount = channelCount[ch];
      best = ch;
    }
  }
  return best;
}
void checkIdleSleep() {
  if (otaRunning || updateInProgress) {
    if (idleSleepActive) {
      setCpuFrequencyMhz(240);
      applyPowerSave();
      idleSleepActive = false;
      LOG_INFO("Exited idle sleep (OTA/update active)");
    }
    return;
  }
  int apClients = WiFi.softAPgetStationNum();
  bool staActive = (WiFi.status() == WL_CONNECTED);
  bool clientActivity = (millis() - lastClientActivity < 60000);
  if (staActive) {
    if (idleSleepActive) {
      setCpuFrequencyMhz(240);
      applyPowerSave();
      idleSleepActive = false;
      LOG_INFO("Exited idle sleep (STA active)");
    }
    lastClientActivity = millis();
    return;
  }
  if (apClients > 0 || clientActivity) {
    if (idleSleepActive) {
      setCpuFrequencyMhz(240);
      applyPowerSave();
      idleSleepActive = false;
      LOG_INFO("Exited idle sleep (client active)");
    }
    if (apClients > 0) {
      lastClientActivity = millis();
    }
    return;
  }
  if (!idleSleepActive) {
    setCpuFrequencyMhz(80);
    esp_wifi_set_ps(WIFI_PS_MAX_MODEM);
    idleSleepActive = true;
    LOG_INFO("Entered idle sleep (no activity)");
  }
}
bool checkHardwareRequirements() {
  size_t flashSize = ESP.getFlashChipSize();
  LOG_INFO("Flash total: %u bytes (%.2f MB)", flashSize, flashSize / (1024.0 * 1024.0));
  if (flashSize < 4 * 1024 * 1024) {
    LOG_WARN("Total flash < 4 MB; OTA may fail");
    return false;
  }
  const esp_partition_t* otaPartition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_0, NULL);
  if (otaPartition == NULL) otaPartition = esp_partition_find_first(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_APP_OTA_1, NULL);
  if (otaPartition == NULL) {
    LOG_ERROR("No OTA partition found");
    return false;
  }
  size_t otaSize = otaPartition->size;
  const size_t MIN_OTA_SIZE = (size_t)(1.5 * 1024 * 1024);
  if (otaSize < MIN_OTA_SIZE) {
    LOG_WARN("OTA partition only %.2f MB", otaSize / (1024.0 * 1024.0));
    return false;
  }
  LOG_INFO("Hardware check passed: OTA partition %.2f MB", otaSize / (1024.0 * 1024.0));
  return true;
}
void printCurrentAppPartition() {
  const esp_partition_t* running = esp_ota_get_running_partition();
  if (!running) return;
  LOG_INFO("Running partition: %s, size=%u bytes, addr=0x%08X",
           running->label, running->size, running->address);
}
void sendSSE(const String& event, const String& data) {
  if (sseClient && sseClient->connected()) {
    sseClient->print("event: " + event + "\ndata: " + data + "\n\n");
    sseClient->flush();
  }
}
void sendOtaLog(const String& msg) {
  otaLog += msg + "\n";
  if (otaLog.length() > 4096) {
    int cut = otaLog.indexOf('\n', otaLog.length() - 4096);
    otaLog.remove(0, cut < 0 ? otaLog.length() - 4096 : cut + 1);
  }
  sendSSE("log", msg);
  LOG_INFO("%s", msg.c_str());
}
void sendOtaProgress() {
  if (otaTotal == 0) return;
  int pct = (int)((otaWritten * 100ULL) / otaTotal);
  String json = "{\"written\":" + String((unsigned long)otaWritten) + ",\"total\":" + String((unsigned long)otaTotal) + ",\"pct\":" + String(pct) + "}";
  sendSSE("progress", json);
}
bool doOtaFromHttp(HTTPClient& http) {
  int contentLength = http.getSize();
  if (contentLength <= 0 || contentLength > 4 * 1024 * 1024) {
    sendOtaLog("Invalid Content-Length: " + String(contentLength));
    return false;
  }
  String url = http.getLocation();
  if (!url.startsWith("https://github.com/") && !url.startsWith("https://raw.githubusercontent.com/")) {
    sendOtaLog("Redirect to untrusted domain: " + url);
    return false;
  }
  otaTotal = (size_t)contentLength;
  otaWritten = 0;
  sendOtaLog("Firmware size: " + String(contentLength) + " bytes (" + String(contentLength / (1024.0 * 1024.0), 2) + " MB)");
  const esp_partition_t* otaPartition = esp_ota_get_next_update_partition(NULL);
  if (!otaPartition) {
    sendOtaLog("No OTA partition found.");
    return false;
  }
  if ((size_t)contentLength > otaPartition->size) {
    sendOtaLog("Firmware larger than OTA partition.");
    return false;
  }
  if (!Update.begin(contentLength)) {
    sendOtaLog(String("Update.begin failed: ") + Update.errorString());
    return false;
  }
  sendOtaLog("Downloading and flashing...");
  sendOtaProgress();
  WiFiClient* stream = http.getStreamPtr();
  uint8_t buf[1024];
  size_t written = 0;
  unsigned long lastPing = millis();
  bool writeOk = true;
  while (written < (size_t)contentLength) {
    if (!http.connected() && !stream->available()) {
      writeOk = false;
      break;
    }
    size_t avail = stream->available();
    if (avail > 0) {
      size_t toRead = avail > sizeof(buf) ? sizeof(buf) : avail;
      int n = stream->readBytes(buf, toRead);
      if (n <= 0) {
        delay(5);
        continue;
      }
      if (Update.write(buf, n) != (size_t)n) {
        writeOk = false;
        break;
      }
      written += n;
      otaWritten = written;
      if (millis() - lastPing > 500) {
        sendOtaProgress();
        lastPing = millis();
      }
    } else {
      delay(5);
    }
    yield();
  }
  sendOtaProgress();
  if (!writeOk || written != (size_t)contentLength) {
    sendOtaLog("Write mismatch: " + String((unsigned long)written) + " / " + String(contentLength));
    Update.abort();
    return false;
  }
  if (!Update.end()) {
    sendOtaLog(String("Update.end failed: ") + Update.errorString());
    Update.abort();
    return false;
  }
  sendOtaLog("OTA successful. Rebooting in 2 s...");
  return true;
}
bool tryDownloadWithFingerprint() {
  if (!isRtcSynced()) {
    LOG_WARN("TLS validation skipped: RTC not synced");
    return false;
  }
  const char* fps[] = { ROOT_CA_FP, GITHUB_LEAF_FP };
  const char* names[] = { "root CA", "github" };
  for (int i = 0; i < 2; i++) {
