Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
    sendOtaLog("Trying fingerprint (" + String(names[i]) + ")...");
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(15000);
    HTTPClient http;
    client.setHandshakeTimeout(30);
    client.setTimeout(15000);
    http.begin(client, updateBinUrl);
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.setTimeout(30000);
    int code = http.GET();
    if (code != HTTP_CODE_OK) {
      sendOtaLog("Fingerprint " + String(names[i]) + " failed (code " + String(code) + ").");
      http.end();
      continue;
    }
    String peerFp = clientFingerprintHex(client);
    peerFp.replace(":", "");
    peerFp.toLowerCase();
    peerFp.trim();
    peerFp.toLowerCase();
    if (!peerFp.equalsIgnoreCase(fps[i])) {
      sendOtaLog("Fingerprint mismatch (" + String(names[i]) + "): got " + peerFp);
      http.end();
      continue;
    }
    sendOtaLog("Fingerprint match (" + String(names[i]) + ").");
    bool ok = doOtaFromHttp(http);
    http.end();
    return ok;
  }
  return false;
}
void otaSecureTask(void* parameter) {
  OtaMode mode = *(OtaMode*)parameter;
  delete (OtaMode*)parameter;
  otaRunning = true;
  otaStartTime = millis();
  otaLog = "";
  sendOtaLog("=== OTA started (mode=" + String(mode == OTA_CA ? "CA" : mode == OTA_FP ? "FP"
                                                                                      : "INSECURE")
             + ") ===");
  bool success = false;
  if (mode == OTA_INSECURE) {
    sendOtaLog("Connecting insecurely (user-confirmed)...");
    WiFiClientSecure client;
    client.setInsecure();
    client.setTimeout(15000);
    HTTPClient http;
    client.setHandshakeTimeout(30);
    client.setTimeout(15000);
    http.begin(client, updateBinUrl);
    http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
    http.setTimeout(30000);
    int code = http.GET();
    if (code == HTTP_CODE_OK) {
      sendOtaLog("Insecure connection established.");
      success = doOtaFromHttp(http);
    } else {
      sendOtaLog("Insecure connection failed (code " + String(code) + ").");
    }
    http.end();
  } else {
    sendOtaLog("Step 1/2: secure connect with Root CA...");
    {
      WiFiClientSecure client;
      client.setCACert(rootCACertificate);
      client.setTimeout(15000);
      HTTPClient http;
      client.setHandshakeTimeout(30);
      client.setTimeout(15000);
      http.begin(client, updateBinUrl);
      http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
      http.setTimeout(30000);
      int code = http.GET();
      if (code == HTTP_CODE_OK) {
        sendOtaLog("Root CA verification OK.");
        success = doOtaFromHttp(http);
      } else {
        sendOtaLog("Root CA verification failed (code " + String(code) + ").");
      }
      http.end();
    }
    if (!success) {
      sendOtaLog("Step 2/2: falling back to fingerprint verification...");
      success = tryDownloadWithFingerprint();
    }
  }
  if (success) {
    sendSSE("ota_state", "rebooting");
    delay(2000);
    ESP.restart();
  } else {
    if (mode == OTA_INSECURE) {
      sendOtaLog("Insecure OTA failed. Giving up.");
      sendSSE("ota_state", "failed");
    } else {
      sendOtaLog("Secure methods failed. Awaiting user confirmation to retry insecurely.");
      sendSSE("ota_state", "insecure_offer");
    }
  }
  otaRunning = false;
  vTaskDelete(NULL);
}
bool isValidUpdateUrl(const String& url) {
  return url.startsWith("https://github.com/Aminiow/ESP32-HID") || url.startsWith("https://raw.githubusercontent.com/Aminiow/");
}
void startSecureOta(bool allowInsecure) {
  if (!isValidUpdateUrl(updateBinUrl)) {
    sendOtaLog("⚠️ Invalid firmware URL - update aborted");
    return;
  }
  if (otaRunning) return;
  if (WiFi.status() != WL_CONNECTED) {
    otaRunning = true;
    sendOtaLog("STA not connected - aborting OTA.");
    sendSSE("ota_state", "failed");
    otaRunning = false;
    return;
  }
  OtaMode* m = new OtaMode(allowInsecure ? OTA_INSECURE : OTA_CA);
  xTaskCreatePinnedToCore(otaSecureTask, "otaSecure", 8192, (void*)m, 1, NULL,
                          CONFIG_ARDUINO_RUNNING_CORE);
}
void handleEvents() {
  if (sseClient) {
    try {
      if (sseClient->connected()) {
        sseClient->stop();
      }
    } catch (...) {
      LOG_WARN("Exception while stopping SSE client");
    }
    delete sseClient;
    sseClient = NULL;
  }
  WiFiClient* newClient = new (std::nothrow) WiFiClient(server.client());
  if (!newClient) {
    LOG_ERROR("Failed to allocate SSE client (out of memory)");
    server.send(503, "text/plain", "Out of memory");
    return;
  }
  sseClient = newClient;
  sseClient->setNoDelay(true);
  sseClient->println("HTTP/1.1 200 OK");
  sseClient->println("Content-Type: text/event-stream");
  sseClient->println("Cache-Control: no-cache");
  sseClient->println("Connection: keep-alive");
  sseClient->println("Access-Control-Allow-Origin: *");
  sseClient->println();
  sseClient->flush();
  if (!otaLog.isEmpty()) {
    int start = 0;
    while (start < (int)otaLog.length()) {
      int nl = otaLog.indexOf('\n', start);
      if (nl < 0) {
        sendSSE("log", otaLog.substring(start));
        break;
      }
      sendSSE("log", otaLog.substring(start, nl));
      start = nl + 1;
    }
  }
  sendSSE("ota_state", otaRunning ? "running" : "idle");
}
void handleStartOtaSecure() {
  if (WiFi.status() != WL_CONNECTED) {
    server.send(503, "text/plain", "STA not connected");
    return;
  }
  if (otaRunning) {
    server.send(409, "text/plain", "OTA already running");
    return;
  }
  server.send(200, "text/plain", "OTA started (secure)");
  startSecureOta(false);
}
void handleStartOtaInsecure() {
  if (WiFi.status() != WL_CONNECTED) {
    server.send(503, "text/plain", "STA not connected");
    return;
  }
  if (otaRunning) {
    server.send(409, "text/plain", "OTA already running");
    return;
  }
  server.send(200, "text/plain", "OTA started (insecure)");
  startSecureOta(true);
}
void sendTimeUpdate() {
  unsigned long uptimeSec = millis() / 1000;
  char up[32];
  snprintf(up, sizeof(up), "%02lu:%02lu:%02lu", uptimeSec / 3600, (uptimeSec % 3600) / 60, uptimeSec % 60);
  time_t now = time(nullptr);
  bool synced = isRtcSynced();
  char utcStr[32] = "not synced";
  if (synced) {
    struct tm ti;
    gmtime_r(&now, &ti);
    strftime(utcStr, sizeof(utcStr), "%Y-%m-%d %H:%M:%S", &ti);
  }
  String json = "{\"uptime\":\"" + String(up) + "\",\"utc\":\"" + String(utcStr) + "\",\"utcTimestamp\":" + String((long)now) + ",\"synced\":" + (synced ? "true" : "false") + "}";
  sendSSE("time", json);
}
const char index_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1,user-scalable=no"><title>ESP32 HID Controller</title><style>
*{box-sizing:border-box;margin:0;padding:0}body{font-family:'Segoe UI',Roboto,sans-serif;background:#0b0b0b;color:#eee;padding:12px;min-height:100vh}.container{max-width:1200px;margin:0 auto;display:grid;grid-template-columns:1fr;gap:16px}@media(min-width:780px){.container{grid-template-columns:1fr 1fr}.full-width{grid-column:1/-1}}.card{background:#1e1e1e;border-radius:16px;padding:18px;border:1px solid #333;box-shadow:0 8px 20px rgba(0,0,0,.5)}h2{font-size:1.6rem;color:#5b9aff;text-align:center;margin-bottom:10px;font-weight:300;letter-spacing:1px}h3{font-size:1.2rem;color:#aaa;text-align:center;margin-bottom:14px;font-weight:400}.slider-group{display:flex;flex-wrap:wrap;align-items:center;justify-content:center;gap:10px 20px;margin:8px 0}.slider-group label{font-size:14px;color:#ccc}input[type=range]{flex:1;min-width:120px;height:4px;appearance:none;background:#444;border-radius:2px;outline:none}input[type=range]::-webkit-slider-thumb{appearance:none;width:16px;height:16px;border-radius:50%;background:#5b9aff;cursor:pointer}.slider-value{min-width:40px;text-align:center;color:#5b9aff;font-weight:600}.btn-group{display:flex;flex-wrap:wrap;gap:8px;justify-content:center;margin:8px 0}button{padding:8px 16px;background:#2a2a2a;color:#eee;border:1px solid #444;border-radius:8px;cursor:pointer;font-size:14px;transition:.15s;font-weight:500;box-shadow:0 2px 4px rgba(0,0,0,.3);user-select:none;-webkit-user-select:none}button:hover{background:#3a3a3a;transform:translateY(-1px)}button:active{transform:translateY(0);background:#444}button.accent{background:#2c5f8a;border-color:#3a7bbd}button.accent:hover{background:#3a7bbd}button.mod-active{background:#f39c12;color:#000;border-color:#f1c40f}button.pressed{background:#f39c12;color:#000;border-color:#f1c40f}button.media{background:#2d4a3e;border-color:#3b6b5a}button.media:hover{background:#3b6b5a}#pad{width:100%;height:200px;background:#181818;border-radius:12px;border:2px solid #333;touch-action:none;cursor:crosshair;margin:10px 0}#pad:active{border-color:#5b9aff}.arrow-row{display:flex;justify-content:center;gap:6px;margin:4px 0}.arrow-row button{min-width:48px;height:44px;font-size:18px}.kb-grid{display:flex;flex-direction:column;gap:5px;width:100%;max-width:900px;margin:12px auto 0;overflow-x:auto}.kb-row{display:flex;gap:5px;width:max-content;min-width:100%}.kb-key{flex:0 0 44px;height:42px;background:#2a2a2a;border:1px solid #444;border-radius:6px;color:#eee;display:flex;align-items:center;justify-content:center;font-size:13px;cursor:pointer;user-select:none;-webkit-user-select:none;touch-action:none;transition:.1s}.kb-key:hover{background:#3a3a3a}.kb-key:active{background:#444}.kb-key.special{background:#2c3e50}.kb-key.special:hover{background:#3e5a6f}.kb-key.mod-down{background:#5b9aff;color:#000}.kb-key.last-clicked{background:#5b9aff;color:#000;border-color:#7ab7ff}.numpad{display:grid;grid-template-columns:repeat(4,48px);grid-template-rows:repeat(5,42px);gap:5px;width:max-content;margin:12px auto 0}.numpad .kb-key{width:48px;height:42px;min-height:42px;flex:none}.row-label{font-size:12px;color:#666;text-align:center;margin:6px 0 2px}.text-input-area{display:flex;gap:10px;flex-wrap:wrap;justify-content:center;margin:10px 0}input[type=text],input[type=password]{background:#222;border:1px solid #444;border-radius:8px;padding:8px 14px;color:#eee;font-size:16px;flex:1;min-width:160px;max-width:380px;outline:none}input[type=text]:focus,input[type=password]:focus{border-color:#5b9aff}.small{font-size:12px;color:#777;text-align:center;margin-top:6px}.log-panel{background:#121212;border:1px solid #333;border-radius:8px;padding:10px;max-height:180px;overflow-y:auto;margin-top:10px;display:none;font-family:monospace;font-size:12px}.log-panel.visible{display:block}.log-entry{padding:2px 0;border-bottom:1px solid #1a1a1a}.log-info{color:#aaa}.log-warn{color:#f39c12}.log-error{color:#e74c3c}.log-success{color:#2ecc71}.sta-status{background:#1a1a1a;border-radius:8px;padding:8px 16px;margin-bottom:10px;display:flex;flex-wrap:wrap;align-items:center;justify-content:space-between;border-left:4px solid #555}.sta-status .label{font-weight:500;color:#aaa}.sta-status .status-text{color:#eee}.sta-status .connected{color:#2ecc71}.sta-status .disconnected{color:#e74c3c}.sta-status .ip{color:#5b9aff}.kb-key.w75{flex-basis:75px}.kb-key.w95{flex-basis:95px}.kb-key.w110{flex-basis:110px}.kb-key.w125{flex-basis:125px}.kb-key.space{flex-basis:220px}@media(max-width:600px){.kb-grid{width:100%;overflow-x:hidden}.kb-key{flex-basis:34px;height:38px;font-size:10px}.kb-key.w75{flex-basis:48px}.kb-key.w95{flex-basis:60px}.kb-key.w110{flex-basis:70px}.kb-key.w125{flex-basis:82px}.kb-key.space{flex-basis:150px}}.remote-shell{width:180px;margin:0 auto;background:linear-gradient(180deg,#2a2a2a,#1a1a1a);border-radius:20px;padding:16px 12px;border:2px solid #444;box-shadow:0 8px 16px rgba(0,0,0,.6),inset 0 1px 0 rgba(255,255,255,.1)}.remote-section{display:flex;justify-content:center}.dpad{display:flex;flex-direction:column;align-items:center;gap:2px}.dpad-up,.dpad-down{width:48px;height:32px;background:#333;border:1px solid #555;border-radius:4px;color:#eee;font-size:16px;cursor:pointer}.dpad-up:hover,.dpad-down:hover{background:#444}.dpad-middle{display:flex;gap:2px;align-items:center}.dpad-left,.dpad-right{width:32px;height:48px;background:#333;border:1px solid #555;border-radius:4px;color:#eee;cursor:pointer}.dpad-left:hover,.dpad-right:hover{background:#444}.dpad-center{width:48px;height:48px;background:#2c5f8a;border:1px solid #3a7bbd;border-radius:50%;color:#fff;font-weight:bold;cursor:pointer;display:flex;align-items:center;justify-content:center}.dpad-center:hover{background:#3a7bbd}.remote-color{width:36px;height:36px;border:1px solid #333;border-radius:50%;cursor:pointer;font-weight:bold;color:#fff}.remote-color:hover{filter:brightness(1.2)}.remote-full{width:100%;padding:8px;background:#333;border:1px solid #555;border-radius:6px;color:#eee;cursor:pointer}.remote-full:hover{background:#444}.remote-half{flex:1;padding:6px;background:#333;border:1px solid #555;border-radius:6px;color:#eee;cursor:pointer;font-size:12px}.remote-half:hover{background:#444}.remote-small{padding:6px 4px;background:#333;border:1px solid #555;border-radius:4px;color:#eee;cursor:pointer;font-size:11px}.remote-small:hover{background:#444}.remote-tiny{padding:4px 2px;background:#333;border:1px solid #555;border-radius:4px;color:#eee;cursor:pointer;font-size:10px}.remote-tiny:hover{background:#444}
</style></head><body><div class="container"><div class="card full-width"><div style="display:flex;justify-content:space-between;align-items:center;"><h2 id="mainHeading" style="margin:0;">⚡ ESP32 HID Controller</h2><div style="display:flex;gap:8px;"><button onclick="window.location.href='/sta'" style="background:#2c5f8a;border-color:#3a7bbd;padding:6px 12px;">📶 WiFi</button><button onclick="window.location.href='/update'" style="background:#2c5f8a;border-color:#3a7bbd;padding:6px 12px;">⬆ Update</button></div></div><div class="sta-status" id="staStatus"><span class="label">Wi-Fi:</span><span class="status-text" id="staStatusText">Loading...</span><span style="margin-left:auto"><button onclick="window.location.href='/sta'" style="background:#333;padding:4px 12px;font-size:12px;">Settings</button></span></div><div class="slider-group"><label>Sensitivity</label><input type="range" id="sens" min="0.5" max="5" step="0.1" value="2.0"><span class="slider-value" id="sensVal">2.0</span><label>Repeat (ms)</label><input type="range" id="repeatRate" min="20" max="500" step="10" value="100"><span class="slider-value" id="repeatVal">100</span><label>Legacy</label><input type="checkbox" id="legacyCheck"><label>BootProto</label><input type="checkbox" id="bootprotoCheck"></div><div class="slider-group"><label>TX Power (dBm)</label><input type="range" id="txPower" min="0" max="20" step="1" value="20"><span class="slider-value" id="txPowerVal">20</span><label>Power Save</label><input type="checkbox" id="psaveCheck"><label>Gyro Mouse</label><input type="checkbox" id="gyroCheck"></div><div class="btn-group"><button onclick="testAll()">🧪 Test All</button><button onclick="toggleLogs()">📋 Logs</button><button onclick="clearLogs()">🗑 Clear</button><button onclick="window.location.href='/logs'" style="background:#333;">📄 Raw Logs</button></div><div id="logPanel" class="log-panel"></div></div><div class="card"><h3>🖱 Mouse</h3><div id="pad"></div><div class="arrow-row"><button data-dx="0" data-dy="-12">▲</button></div><div class="arrow-row"><button data-dx="-12" data-dy="0">◀</button><button data-dx="0" data-dy="12">▼</button><button data-dx="12" data-dy="0">▶</button></div><div class="btn-group"><button class="accent" onclick="sendHTTP('/click?btn=left')">Left</button><button class="accent" onclick="sendHTTP('/click?btn=right')">Right</button><button class="accent" onclick="sendHTTP('/click?btn=middle')">Middle</button><button class="accent" onclick="sendHTTP('/double?btn=left')">Double</button></div><div class="btn-group"><button id="mouseLeftDown" data-btn="left">L⬇</button><button id="mouseLeftUp" data-btn="left" onclick="mouseUp('left')">L⬆</button><button id="mouseRightDown" data-btn="right">R⬇</button><button id="mouseRightUp" data-btn="right" onclick="mouseUp('right')">R⬆</button><button onclick="sendHTTP('/wheel?delta=-1')">⬆</button><button onclick="sendHTTP('/wheel?delta=1')">⬇</button></div><div class="small">Drag on pad to move. Tap for left click. Arrows hold-to-repeat.</div></div><div class="card"><h3>⌨ Keyboard</h3><div class="btn-group" id="modButtons"><button data-mod="CTRL">Ctrl</button><button data-mod="ALT">Alt</button><button data-mod="SHIFT">Shift</button><button data-mod="WIN">Win</button></div><div class="text-input-area"><input type="text" id="textInput" placeholder="Type text to send..."><button class="accent" onclick="sendText()">Send</button></div><div class="text-input-area"><input type="text" id="realtimeInput" placeholder="Real-time typing" autocomplete="off"></div><div id="keyboard" class="kb-grid"></div><div class="row-label">Numpad</div><div id="numpad" class="numpad"></div><div class="small">Sticky modifiers toggled via buttons above. Keyboard keys press/release on hold.</div></div><div class="card"><h3>📱 Remote Control</h3><div style="display:flex;justify-content:center;margin:20px 0"><div class="remote-shell"><div class="remote-section"><div class="dpad"><button class="dpad-up" onclick="consumer('UP')">▲</button><div class="dpad-middle"><button class="dpad-left" onclick="consumer('LEFT')">◀</button><button class="dpad-center" onclick="consumer('OK')">OK</button><button class="dpad-right" onclick="consumer('RIGHT')">▶</button></div><button class="dpad-down" onclick="consumer('DOWN')">▼</button></div></div><div class="remote-section" style="margin-top:16px"><div style="display:grid;grid-template-columns:repeat(4,1fr);gap:6px;width:160px;margin:0 auto"><button class="remote-color" style="background:#c0392b" onclick="consumer('RED')">R</button><button class="remote-color" style="background:#27ae60" onclick="consumer('GREEN')">G</button><button class="remote-color" style="background:#f1c40f;color:#000" onclick="consumer('YELLOW')">Y</button><button class="remote-color" style="background:#2980b9" onclick="consumer('BLUE')">B</button></div></div><div class="remote-section" style="margin-top:16px"><div style="display:flex;flex-direction:column;gap:8px;width:160px;margin:0 auto"><button class="remote-full" onclick="consumer('POWER')">⏻ Power</button><div style="display:flex;gap:4px"><button class="remote-half" onclick="consumer('VOLUME_UP')">🔊+</button><button class="remote-half" onclick="consumer('VOLUME_DOWN')">🔊−</button></div><div style="display:flex;gap:4px"><button class="remote-half" onclick="consumer('CHANNEL_UP')">CH+</button><button class="remote-half" onclick="consumer('CHANNEL_DOWN')">CH−</button></div><button class="remote-full" onclick="consumer('MUTE')">🔇 Mute</button></div></div><div class="remote-section" style="margin-top:16px"><div style="display:grid;grid-template-columns:repeat(2,1fr);gap:6px;width:160px;margin:0 auto"><button class="remote-small" onclick="consumer('HOME')">Home</button><button class="remote-small" onclick="consumer('BACK')">Back</button><button class="remote-small" onclick="consumer('INPUT_MENU')">Menu</button><button class="remote-small" onclick="consumer('EXIT')">Exit</button></div></div><div class="remote-section" style="margin-top:16px"><div style="display:grid;grid-template-columns:repeat(5,1fr);gap:4px;width:160px;margin:0 auto"><button class="remote-tiny" onclick="consumer('REWIND')">⏪</button><button class="remote-tiny" onclick="consumer('PLAY')">▶</button><button class="remote-tiny" onclick="consumer('PAUSE')">⏸</button><button class="remote-tiny" onclick="consumer('STOP')">⏹</button><button class="remote-tiny" onclick="consumer('FAST_FORWARD')">⏩</button></div></div></div></div></div><div class="card"><h3>🎛️ Media / TV</h3><div class="btn-group"><button class="media" onclick="consumer('PLAY')">▶ Play</button><button class="media" onclick="consumer('PAUSE')">⏸ Pause</button><button class="media" onclick="consumer('STOP')">⏹ Stop</button><button class="media" onclick="consumer('REWIND')">⏪ Rew</button><button class="media" onclick="consumer('FAST_FORWARD')">⏩ FF</button></div><div class="btn-group"><button class="media" onclick="consumer('PREV')">⏮ Prev</button><button class="media" onclick="consumer('NEXT')">⏭ Next</button><button class="media" onclick="consumer('RECORD')">⏺ Rec</button><button class="media" onclick="consumer('EJECT')">⏏ Eject</button></div><div class="btn-group"><button class="media" onclick="consumer('VOLUME_UP')">🔊 +</button><button class="media" onclick="consumer('VOLUME_DOWN')">🔊 −</button><button class="media" onclick="consumer('MUTE')">🔇 Mute</button><button class="media" onclick="consumer('CHANNEL_UP')">📺 CH+</button><button class="media" onclick="consumer('CHANNEL_DOWN')">📺 CH−</button></div><div class="btn-group"><button class="media" onclick="consumer('POWER')">⏻ Power</button><button class="media" onclick="consumer('HOME')">🏠 Home</button><button class="media" onclick="consumer('AV_LIST')">📋 AV List</button><button class="media" onclick="consumer('SEARCH')">🔍 Search</button><button class="media" onclick="consumer('FAVORITES')">⭐ Favorites</button></div><div class="btn-group"><button class="media" onclick="consumer('INPUT_MENU')">📡 Menu</button><button class="media" onclick="consumer('INPUT_SELECT')">📡 Source</button><button class="media" onclick="consumer('BACK')">↩ Back</button><button class="media" onclick="consumer('EXIT')">✖ Exit</button><button class="media" onclick="consumer('INFO')">ℹ Info</button></div><div class="btn-group"><button style="background:#c0392b;border-color:#e74c3c" onclick="consumer('RED')">● R</button><button style="background:#27ae60;border-color:#2ecc71" onclick="consumer('GREEN')">● G</button><button style="background:#f1c40f;color:#000;border-color:#f39c12" onclick="consumer('YELLOW')">● Y</button><button style="background:#2980b9;border-color:#3498db" onclick="consumer('BLUE')">● B</button></div><div class="btn-group" id="tvNumberRow"><button class="media" onclick="sendHTTP('/type?text=1')">1</button><button class="media" onclick="sendHTTP('/type?text=2')">2</button><button class="media" onclick="sendHTTP('/type?text=3')">3</button><button class="media" onclick="sendHTTP('/type?text=4')">4</button><button class="media" onclick="sendHTTP('/type?text=5')">5</button><button class="media" onclick="sendHTTP('/type?text=6')">6</button><button class="media" onclick="sendHTTP('/type?text=7')">7</button><button class="media" onclick="sendHTTP('/type?text=8')">8</button><button class="media" onclick="sendHTTP('/type?text=9')">9</button><button class="media" onclick="sendHTTP('/type?text=0')">0</button><button class="media" onclick="sendHTTP('/key?key=ENTER')">OK</button></div><div class="small">Number row sends digit keystrokes — useful for direct channel entry on TV apps.</div></div></div><script><!--
