Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
let wsReconnectTimer=null,sensSaveTimer=null,repeatSaveTimer=null,realtimeChangeTimer=null,logs=[];const LOG_KEY="esp32_logs";function loadLogs(){try{const s=sessionStorage.getItem(LOG_KEY);if(s)logs=JSON.parse(s)}catch(e){logs=[]}}function saveLogs(){try{sessionStorage.setItem(LOG_KEY,JSON.stringify(logs))}catch(e){}}function addLog(level,msg){logs.push({ts:new Date().toISOString(),level:level,msg:msg});if(logs.length>200)logs.shift();saveLogs();renderLogs()}function logInfo(m){addLog("info",m)}function logWarn(m){addLog("warn",m)}function logError(m){addLog("error",m)}function logSuccess(m){addLog("success",m)}function renderLogs(){const p=document.getElementById("logPanel");if(!p)return;p.innerHTML="";logs.forEach(e=>{const d=document.createElement("div");d.className="log-entry log-"+e.level;d.textContent="["+e.ts+"] "+e.level.toUpperCase()+": "+e.msg;p.appendChild(d)});p.scrollTop=p.scrollHeight}function toggleLogs(){const p=document.getElementById("logPanel");p.classList.toggle("visible");if(p.classList.contains("visible"))renderLogs()}function clearLogs(){logs=[];saveLogs();renderLogs();logInfo("Logs cleared")}loadLogs();renderLogs();logInfo("Page loaded");let socket=null,wsRetries=0;const MAX_WS_RETRIES=30;function connectWS(){if(wsRetries>=MAX_WS_RETRIES){logError("❌ WebSocket reconnection limit ("+MAX_WS_RETRIES+") reached.");logError("   Please refresh the page or check the connection.");return}try{socket=new WebSocket("ws://"+location.hostname+":81/");socket.onopen=()=>{wsRetries=0;logSuccess("WebSocket connected")};socket.onclose=()=>{wsRetries++;const b=Math.min(2000*Math.pow(1.5,wsRetries),30000);logWarn("WebSocket closed ("+wsRetries+"/"+MAX_WS_RETRIES+"), reconnecting in "+(b/1000).toFixed(1)+"s...");if(wsReconnectTimer)clearTimeout(wsReconnectTimer);wsReconnectTimer=setTimeout(connectWS,b)};socket.onerror=()=>{logError("WebSocket error");try{if(socket)socket.close()}catch(e){}}}catch(e){logError("WebSocket creation failed: "+e.message);wsRetries++;const b=Math.min(2000*Math.pow(1.5,wsRetries),30000);if(wsReconnectTimer)clearTimeout(wsReconnectTimer);wsReconnectTimer=setTimeout(connectWS,b)}}connectWS();function sendHTTP(url,timeout=10000){return new Promise((resolve,reject)=>{const t=setTimeout(()=>reject(new Error("HTTP request timeout after "+timeout+"ms")),timeout);fetch(url,{cache:"no-store"}).then(res=>{clearTimeout(t);if(!res.ok){const e="HTTP "+res.status+" "+res.statusText+" for "+url;logWarn(e);reject(new Error(e))}else{logInfo("HTTP OK: "+url);resolve(res)}}).catch(err=>{clearTimeout(t);logError("Fetch failed for "+url+": "+err.message);reject(err)})})}function sendMove(dx,dy){const rx=Math.max(-127,Math.min(127,Math.round(dx*sens))),ry=Math.max(-127,Math.min(127,Math.round(dy*sens)));if(socket&&socket.readyState===WebSocket.OPEN)socket.send('{"dx":'+rx+',"dy":'+ry+'}');else sendHTTP("/move?dx="+encodeURIComponent(rx)+"&dy="+encodeURIComponent(ry))}let sens=2.0,repeatInterval=100,legacyMode=false,bootProto=false,gyroEnabled=false;const SETTINGS_SAVE_DEBOUNCE_MS=800;document.getElementById("sens").addEventListener("input",function(){sens=parseFloat(this.value);document.getElementById("sensVal").textContent=sens.toFixed(1);clearTimeout(sensSaveTimer);sensSaveTimer=setTimeout(()=>{sendHTTP("/set_sensitivity?value="+encodeURIComponent(sens)).catch(err=>logWarn("Failed to save sensitivity: "+err.message))},SETTINGS_SAVE_DEBOUNCE_MS);logInfo("Sensitivity = "+sens)});document.getElementById("repeatRate").addEventListener("input",function(){repeatInterval=parseInt(this.value);document.getElementById("repeatVal").textContent=repeatInterval;clearTimeout(repeatSaveTimer);repeatSaveTimer=setTimeout(()=>{sendHTTP("/set_repeat?value="+encodeURIComponent(repeatInterval)).catch(err=>logWarn("Failed to save repeat rate: "+err.message))},SETTINGS_SAVE_DEBOUNCE_MS);logInfo("Repeat interval = "+repeatInterval)});document.getElementById("legacyCheck").addEventListener("change",function(){legacyMode=this.checked;sendHTTP("/set_legacy?value="+(legacyMode?1:0)).catch(()=>{});logInfo("Legacy mode = "+legacyMode)});document.getElementById("bootprotoCheck").addEventListener("change",function(){bootProto=this.checked;sendHTTP("/set_bootproto?value="+(bootProto?1:0)).catch(()=>{});logInfo("Boot protocol mode = "+bootProto)});document.getElementById("gyroCheck").addEventListener("change",function(){const cb=this,want=this.checked;if(!want){gyroEnabled=false;window.removeEventListener("deviceorientation",handleOrientation);sendHTTP("/set_gyro?value=0").catch(()=>{});logInfo("Gyro disabled");return}if(typeof DeviceOrientationEvent!=="undefined"&&typeof DeviceOrientationEvent.requestPermission==="function"){DeviceOrientationEvent.requestPermission().then(state=>{if(state==="granted"){gyroEnabled=true;window.addEventListener("deviceorientation",handleOrientation);sendHTTP("/set_gyro?value=1").catch(()=>{});logSuccess("Gyro permission granted and enabled")}else{gyroEnabled=false;cb.checked=false;logWarn("Gyro permission denied by user")}}).catch(err=>{gyroEnabled=false;cb.checked=false;logError("Gyro permission error: "+err.message)})}else{gyroEnabled=true;window.addEventListener("deviceorientation",handleOrientation);sendHTTP("/set_gyro?value=1").catch(()=>{});logInfo("Gyro enabled (no permission required on this device)")}});function handleOrientation(e){if(!gyroEnabled)return;const dx=Math.round((e.gamma||0)*.5),dy=Math.round((e.beta||0)*.5);if(dx!==0||dy!==0){if(socket&&socket.readyState===WebSocket.OPEN)socket.send('{"gyro":1,"dx":'+clamp(dx,-127,127)+',"dy":'+clamp(dy,-127,127)+'}');else sendHTTP("/move?dx="+encodeURIComponent(clamp(dx,-127,127))+"&dy="+encodeURIComponent(clamp(dy,-127,127)))}}function clamp(v,min,max){return Math.max(min,Math.min(max,v))}document.getElementById("txPower").addEventListener("input",function(){const v=parseInt(this.value);document.getElementById("txPowerVal").textContent=v;sendHTTP("/set_txpower?value="+v).catch(()=>{})});document.getElementById("psaveCheck").addEventListener("change",function(){sendHTTP("/set_psave?value="+(this.checked?1:0)).catch(()=>{})});function updateSTAStatus(){fetch("/sta/status",{cache:"no-store"}).then(res=>res.json()).then(data=>{const st=document.getElementById("staStatusText");st.textContent="";if(data.connected){const c=document.createElement("span");c.className="connected";c.textContent="Connected";st.appendChild(c);st.appendChild(document.createTextNode(" to "));const s=document.createElement("strong");s.textContent=data.ssid||"";st.appendChild(s);st.appendChild(document.createTextNode(" (IP: "));const ip=document.createElement("span");ip.className="ip";ip.textContent=data.ip||"";st.appendChild(ip);st.appendChild(document.createTextNode(")"))}else{const d=document.createElement("span");d.className="disconnected";d.textContent="Disconnected";st.appendChild(d);st.appendChild(document.createTextNode(" - "+(data.error||"Not connected")))}}).catch(()=>{})}setInterval(updateSTAStatus,3000);updateSTAStatus();const pad=document.getElementById("pad");let padDown=false,startX=0,startY=0,lastX=0,lastY=0,moved=false,startTime=0;const MOUSE_PAD_DEADZONE=10;pad.addEventListener("pointerdown",e=>{pad.setPointerCapture(e.pointerId);padDown=true;startX=e.clientX;startY=e.clientY;lastX=e.clientX;lastY=e.clientY;moved=false;startTime=Date.now();pad.style.borderColor="#5b9aff";e.preventDefault()});pad.addEventListener("pointermove",e=>{if(!padDown)return;const dx=e.clientX-lastX,dy=e.clientY-lastY;lastX=e.clientX;lastY=e.clientY;if(!moved&&(Math.abs(e.clientX-startX)>MOUSE_PAD_DEADZONE||Math.abs(e.clientY-startY)>MOUSE_PAD_DEADZONE))moved=true;if(moved)sendMove(dx,dy);e.preventDefault()});pad.addEventListener("pointerup",e=>{if(!padDown)return;padDown=false;pad.style.borderColor="#333";if(!moved&&Date.now()-startTime<300)sendHTTP("/click?btn=left").catch(()=>{});e.preventDefault()});pad.addEventListener("pointercancel",()=>{padDown=false;pad.style.borderColor="#333"});pad.addEventListener("lostpointercapture",()=>{padDown=false;pad.style.borderColor="#333"});let repeatTimer=null;function stopArrowRepeat(){if(repeatTimer!==null){clearInterval(repeatTimer);repeatTimer=null}}document.querySelectorAll(".arrow-row button[data-dx]").forEach(btn=>{const dx=parseInt(btn.dataset.dx),dy=parseInt(btn.dataset.dy);btn.addEventListener("pointerdown",e=>{e.preventDefault();try{btn.setPointerCapture(e.pointerId)}catch(_){}stopArrowRepeat();sendMove(dx,dy);repeatTimer=setInterval(()=>{sendMove(dx,dy)},repeatInterval)});btn.addEventListener("pointerup",stopArrowRepeat);btn.addEventListener("pointercancel",stopArrowRepeat);btn.addEventListener("lostpointercapture",stopArrowRepeat)});const mouseState={left:false,right:false};function updateMouseUI(){document.getElementById("mouseLeftDown").classList.toggle("pressed",mouseState.left);document.getElementById("mouseRightDown").classList.toggle("pressed",mouseState.right)}function mouseDown(btn){if(btn==="left"&&!mouseState.left){mouseState.left=true;sendHTTP("/down?btn=left").catch(()=>{})}else if(btn==="right"&&!mouseState.right){mouseState.right=true;sendHTTP("/down?btn=right").catch(()=>{})}updateMouseUI()}function mouseUp(btn){if(btn==="left"&&mouseState.left){mouseState.left=false;sendHTTP("/up?btn=left").catch(()=>{})}else if(btn==="right"&&mouseState.right){mouseState.right=false;sendHTTP("/up?btn=right").catch(()=>{})}updateMouseUI()}function releaseMouseButtons(){if(mouseState.left)sendHTTP("/up?btn=left").catch(()=>{});if(mouseState.right)sendHTTP("/up?btn=right").catch(()=>{});mouseState.left=false;mouseState.right=false;updateMouseUI()}function setupMouseHold(id,btn){const el=document.getElementById(id);el.addEventListener("pointerdown",e=>{e.preventDefault();try{el.setPointerCapture(e.pointerId)}catch(_){}mouseDown(btn)});el.addEventListener("pointerup",e=>{e.preventDefault();mouseUp(btn)});el.addEventListener("pointercancel",()=>{mouseUp(btn)});el.addEventListener("lostpointercapture",()=>{mouseUp(btn)})}setupMouseHold("mouseLeftDown","left");setupMouseHold("mouseRightDown","right");const modState={CTRL:false,ALT:false,SHIFT:false,WIN:false};document.querySelectorAll("#modButtons button").forEach(btn=>{btn.addEventListener("click",()=>{const mod=btn.dataset.mod;modState[mod]=!modState[mod];btn.classList.toggle("mod-active",modState[mod]);sendHTTP("/toggle_modifier?mod="+encodeURIComponent(mod)).catch(()=>{});logInfo("Sticky "+mod+" = "+modState[mod])})});const heldKeyCounts=new Map();function holdKey(code){const c=heldKeyCounts.get(code)||0;heldKeyCounts.set(code,c+1)}function releaseKey(code){const c=heldKeyCounts.get(code)||0;if(c<=1)heldKeyCounts.delete(code);else heldKeyCounts.set(code,c-1)}function releaseHeldKeys(){heldKeyCounts.forEach((c,code)=>{if(c>0)sendHTTP("/key_up?key="+encodeURIComponent(code)).catch(()=>{})});heldKeyCounts.clear();document.querySelectorAll(".mod-down").forEach(el=>el.classList.remove("mod-down"));sendHTTP("/reset_modifiers").catch(()=>{});Object.keys(modState).forEach(k=>{modState[k]=false});document.querySelectorAll("#modButtons button").forEach(btn=>btn.classList.remove("mod-active"));logInfo("All held keys/modifiers released")}async function cleanupAllHeldKeys(){stopArrowRepeat();releaseMouseButtons();try{await sendHTTP("/reset_modifiers").catch(()=>{});logInfo("Cleaned up all held keys")}catch(err){logWarn("Cleanup failed: "+err.message)}}window.addEventListener("blur",()=>{logInfo("Window blur - releasing all held keys");cleanupAllHeldKeys()});document.addEventListener("visibilitychange",()=>{if(document.hidden){logInfo("Page hidden - releasing all held keys");cleanupAllHeldKeys()}});const keyMap={Esc:"ESC",Backspace:"BACKSPACE",Tab:"TAB",CapsLock:"CAPSLOCK",Enter:"ENTER",Shift:"SHIFT",Ctrl:"CTRL",Alt:"ALT",Win:"WINDOWS",Space:"SPACE",Insert:"INSERT",Home:"HOME",PageUp:"PAGEUP",Delete:"DELETE",End:"END",PageDown:"PAGEDOWN",Up:"UP",Down:"DOWN",Left:"LEFT",Right:"RIGHT",PrtSc:"PRTSC",ScrLk:"SCRLK",Pause:"PAUSE",NumLock:"NUMLOCK",Menu:"MENU","Num /":"KP_SLASH","Num *":"KP_ASTERISK","Num -":"KP_MINUS","Num +":"KP_PLUS","Num Enter":"KP_ENTER",0:"KP_0",1:"KP_1",2:"KP_2",3:"KP_3",4:"KP_4",5:"KP_5",6:"KP_6",7:"KP_7",8:"KP_8",9:"KP_9",".":"KP_DOT"};for(let i=1;i<=12;i++)keyMap["F"+i]="F"+i;let lastClickedKey=null;function highlightKey(el){if(lastClickedKey&&lastClickedKey!==el)lastClickedKey.classList.remove("last-clicked");if(el){el.classList.add("last-clicked");lastClickedKey=el}else lastClickedKey=null}function buildKeyboard(){const grid=document.getElementById("keyboard");grid.innerHTML="";const rows=[[["Esc","w75"],["F1",""],["F2",""],["F3",""],["F4",""],["F5",""],["F6",""],["F7",""],["F8",""],["F9",""],["F10",""],["F11",""],["F12",""],["PrtSc","w75"],["ScrLk","w75"],["Pause","w75"]],[["`",""],["1",""],["2",""],["3",""],["4",""],["5",""],["6",""],["7",""],["8",""],["9",""],["0",""],["-",""],["=",""],["Backspace","w110"]],[["Tab","w75"],["q",""],["w",""],["e",""],["r",""],["t",""],["y",""],["u",""],["i",""],["o",""],["p",""],["[",""],["]",""],["\\","w75"]],[["CapsLock","w95"],["a",""],["s",""],["d",""],["f",""],["g",""],["h",""],["j",""],["k",""],["l",""],[";",""],["'",""],["Enter","w95"]],[["Shift","w125"],["z",""],["x",""],["c",""],["v",""],["b",""],["n",""],["m",""],[" ",""],["."],["/",""],["Shift","w125"]],[["Ctrl","w75"],["Win","w75"],["Alt","w75"],["Space","space"],["Alt","w75"],["Win","w75"],["Menu","w75"],["Ctrl","w75"]]];rows.forEach(row=>{const r=document.createElement("div");r.className="kb-row";row.forEach(([label,size])=>{const el=document.createElement("div");el.className="kb-key";if(size)el.classList.add(size);el.textContent=label;if(["Esc","F1","F2","F3","F4","F5","F6","F7","F8","F9","F10","F11","F12","PrtSc","ScrLk","Pause"].includes(label))el.classList.add("special");const isMod=["Shift","Ctrl","Alt","Win"].includes(label);if(isMod){el.addEventListener("pointerdown",e=>{e.preventDefault();try{el.setPointerCapture(e.pointerId)}catch(_){}const code=keyMap[label];if(!code)return;sendHTTP("/key_down?key="+encodeURIComponent(code)).catch(()=>{});holdKey(code);el.classList.add("mod-down")});el.addEventListener("pointerup",e=>{e.preventDefault();const code=keyMap[label];if(!code)return;sendHTTP("/key_up?key="+encodeURIComponent(code)).catch(()=>{});releaseKey(code);el.classList.remove("mod-down")});el.addEventListener("pointercancel",()=>{const code=keyMap[label];if(!code)return;sendHTTP("/key_up?key="+encodeURIComponent(code)).catch(()=>{});releaseKey(code);el.classList.remove("mod-down")})}else{el.addEventListener("click",()=>{const code=keyMap[label];if(code)sendHTTP("/key?key="+encodeURIComponent(code)).catch(()=>{});else if(label.length===1)sendHTTP("/type?text="+encodeURIComponent(label)).catch(()=>{});else sendHTTP("/key?key="+encodeURIComponent(label)).catch(()=>{});highlightKey(el)})}r.appendChild(el)});grid.appendChild(r)})}function buildNumpad(){const c=document.getElementById("numpad");c.innerHTML="";const keys=[["NumLock",1],["Num /",1],["Num *",1],["Num -",1],["KP_7",1],["KP_8",1],["KP_9",1],["KP_4",1],["KP_5",1],["KP_6",1],["KP_1",1],["KP_2",1],["KP_3",1],["KP_0",2],["KP_DOT",1]];keys.forEach(([label,cs])=>{const el=document.createElement("div");el.className="kb-key";if(cs===2)el.style.gridColumn="span 2";const dn={KP_0:"0",KP_1:"1",KP_2:"2",KP_3:"3",KP_4:"4",KP_5:"5",KP_6:"6",KP_7:"7",KP_8:"8",KP_9:"9",KP_DOT:"."}[label]||label;el.textContent=dn;if(label==="NumLock"){el.addEventListener("click",()=>{const code=keyMap[label];if(!code)return;sendHTTP("/key?key="+encodeURIComponent(code)).catch(()=>{});highlightKey(el)})}else{el.addEventListener("click",()=>{const code=keyMap[label];if(code)sendHTTP("/key?key="+encodeURIComponent(code)).catch(()=>{});highlightKey(el)})}c.appendChild(el)});const plus=document.createElement("div");plus.className="kb-key";plus.textContent="+";plus.style.gridColumn="4";plus.style.gridRow="2 / span 2";plus.addEventListener("click",()=>{sendHTTP("/key?key=KP_PLUS").catch(()=>{});highlightKey(plus)});c.appendChild(plus);const enter=document.createElement("div");enter.className="kb-key";enter.textContent="Enter";enter.style.gridColumn="4";enter.style.gridRow="4 / span 2";enter.addEventListener("click",()=>{sendHTTP("/key?key=KP_ENTER").catch(()=>{});highlightKey(enter)});c.appendChild(enter)}buildKeyboard();buildNumpad();function sendText(){const i=document.getElementById("textInput"),v=i.value;if(!v)return;sendHTTP("/type?text="+encodeURIComponent(v)).catch(()=>{});i.value=""}let realtimeOld="";const realInput=document.getElementById("realtimeInput");async function replaceSelectedText(nv){try{await sendHTTP("/key_down?key=CTRL").catch(()=>{});await new Promise(r=>setTimeout(r,50));await sendHTTP("/key?key=A").catch(()=>{});await new Promise(r=>setTimeout(r,50));await sendHTTP("/key_up?key=CTRL").catch(()=>{});await new Promise(r=>setTimeout(r,100));await sendHTTP("/type?text="+encodeURIComponent(nv)).catch(()=>{})}catch(err){logError("Replace text failed: "+err.message)}}realInput.addEventListener("focus",()=>{realtimeOld=realInput.value});realInput.addEventListener("input",function(){const nv=this.value;if(realtimeChangeTimer)clearTimeout(realtimeChangeTimer);realtimeChangeTimer=setTimeout(async()=>{if(nv.startsWith(realtimeOld)&&nv.length>realtimeOld.length){const ins=nv.substring(realtimeOld.length);try{await sendHTTP("/type?text="+encodeURIComponent(ins));realtimeOld=nv}catch(err){logError("Type failed: "+err.message)}return}if(realtimeOld.startsWith(nv)&&nv.length<realtimeOld.length){const dc=realtimeOld.length-nv.length;try{for(let i=0;i<dc;i++)await sendHTTP("/key?key=BACKSPACE");realtimeOld=nv}catch(err){logError("Backspace failed: "+err.message)}return}if(nv!==realtimeOld){await replaceSelectedText(nv);realtimeOld=nv}},100)});function sleep(ms){return new Promise(r=>setTimeout(r,ms))}async function testAll(){await cleanupAllHeldKeys();logInfo("=== Starting test ===");const tests=[{endpoint:"/click?btn=left",delay:200,name:"Left click"},{endpoint:"/click?btn=right",delay:200,name:"Right click"},{endpoint:"/move?dx=30&dy=0",delay:200,name:"Move right"},{endpoint:"/move?dx=0&dy=30",delay:200,name:"Move down"},{endpoint:"/wheel?delta=1",delay:200,name:"Wheel"},{endpoint:"/type?text=Hello",delay:300,name:"Type"},{endpoint:"/key?key=ENTER",delay:200,name:"Enter key"},{endpoint:"/key?key=BACKSPACE",delay:200,name:"Backspace"},{endpoint:"/toggle_modifier?mod=SHIFT",delay:200,name:"Shift toggle"},{endpoint:"/type?text=a",delay:200,name:"Type a"},{endpoint:"/toggle_modifier?mod=SHIFT",delay:200,name:"Shift untoggle"}];let p=0,f=0;for(const t of tests){try{await sendHTTP(t.endpoint);logSuccess("✓ "+t.name);p++;await sleep(t.delay)}catch(err){logError("✗ "+t.name+": "+err.message);f++}}logInfo("Test complete: "+p+" passed, "+f+" failed")}sendHTTP("/reset_modifiers").catch(()=>{});logInfo("Modifiers reset");const VALID_CONSUMER_KEYS=["VOLUME_UP","VOLUME_DOWN","MUTE","CHANNEL_UP","CHANNEL_DOWN","POWER","INPUT_MENU","INPUT_SELECT","AV_LIST","BACK","EXIT","HOME","PLAY","PAUSE","STOP","FAST_FORWARD","REWIND","NEXT","PREV","RECORD","EJECT","SEARCH","INFO","FAVORITES","RED","GREEN","YELLOW","BLUE","UP","DOWN","LEFT","RIGHT","OK"];function consumer(key){if(!VALID_CONSUMER_KEYS.includes(key)){logError("Invalid consumer key: "+key);return}sendHTTP("/consumer?key="+encodeURIComponent(key)).then(()=>logSuccess("Consumer key sent: "+key)).catch(err=>logError("Consumer key failed: "+err.message))}function updateVersionDisplay(){fetch("/update_status",{cache:"no-store"}).then(res=>res.json()).then(data=>{const v=data.current||"?";document.title="ESP32 HID Controller v"+v;const h=document.getElementById("mainHeading");if(h)h.textContent="⚡ ESP32 HID Controller v"+v}).catch(()=>{})}fetch("/get_settings",{cache:"no-store"}).then(r=>r.json()).then(s=>{const ck=(id,v)=>{const e=document.getElementById(id);if(e)e.checked=!!v};const rg=(id,v,out)=>{const e=document.getElementById(id);if(e){e.value=v;const o=document.getElementById(out);if(o)o.textContent=v}};rg("sens",s.sens,"sensVal");rg("repeatRate",s.repeat,"repeatVal");rg("txPower",s.txpwr,"txPowerVal");ck("legacyCheck",s.legacy);ck("bootprotoCheck",s.bootproto);ck("gyroCheck",s.gyro);ck("psaveCheck",s.psave);sens=parseFloat(s.sens);repeatInterval=parseInt(s.repeat);legacyMode=!!s.legacy;bootProto=!!s.bootproto;gyroEnabled=!!s.gyro}).catch(()=>{});updateVersionDisplay();window.addEventListener("beforeunload",()=>{if(typeof wsReconnectTimer!=="undefined"&&wsReconnectTimer)clearTimeout(wsReconnectTimer);if(typeof sensSaveTimer!=="undefined"&&sensSaveTimer)clearTimeout(sensSaveTimer);if(typeof repeatSaveTimer!=="undefined"&&repeatSaveTimer)clearTimeout(repeatSaveTimer);if(typeof realtimeChangeTimer!=="undefined"&&realtimeChangeTimer)clearTimeout(realtimeChangeTimer);try{if(socket&&socket.readyState===WebSocket.OPEN)socket.close()}catch(e){}try{fetch("/reset_modifiers",{keepalive:true,cache:"no-store"})}catch(e){}logInfo("Page unloading - cleanup requested")});//--></script></body></html>
)rawliteral";
const char sta_html[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1"><title>WiFi Settings</title><style>
body{font-family:'Segoe UI',Roboto,sans-serif;background:#0b0b0b;color:#eee;padding:20px}.container{max-width:500px;margin:0 auto;background:#1e1e1e;border-radius:16px;padding:24px;border:1px solid #333}h2{color:#5b9aff;text-align:center}label{display:block;margin:12px 0 4px;color:#aaa}input[type=text],input[type=password]{width:100%;padding:8px;background:#222;border:1px solid #444;border-radius:6px;color:#eee}input[type=checkbox]{margin-right:8px}button{padding:10px 20px;background:#5b9aff;border:none;border-radius:8px;color:#fff;font-weight:bold;cursor:pointer;margin-top:12px}button:hover{background:#3a7bbd}button.secondary{background:#444}.status-box{background:#111;padding:10px;border-radius:8px;margin:12px 0}.connected{color:#2ecc71}.disconnected{color:#e74c3c}.info{color:#aaa;font-size:14px}.network-list{max-height:200px;overflow-y:auto;background:#111;border-radius:6px;padding:4px;margin-top:6px}.network-item{padding:6px 8px;cursor:pointer;border-bottom:1px solid #222;display:flex;justify-content:space-between;align-items:center;gap:10px}.network-item:hover{background:#2a2a2a}.network-item .bssid{color:#888;font-size:12px}.network-item .rssi{color:#666;font-size:12px}.network-item .enc{color:#5b9aff;font-size:12px}.hidden-note{background:#2a2a2a;padding:8px;border-radius:6px;margin:8px 0;font-size:14px;border-left:3px solid #f39c12}.scanning-msg{text-align:center;color:#aaa;padding:10px}.error-msg{color:#e74c3c}
</style></head><body><div class="container"><h2>🔧 WiFi Settings</h2><div id="statusBox" class="status-box">Loading...</div><div class="hidden-note">⚠️ <strong>Hidden networks</strong> are included in scans. If your network does not broadcast its SSID, you can also manually enter the SSID and BSSID.</div><label>SSID</label><input type="text" id="ssid" placeholder="Network name"><div id="networkList" class="network-list"><div class="scanning-msg">Scanning for networks...</div></div><label>Password</label><input type="password" id="pass" placeholder="Password"><label>BSSID (MAC) <span class="info">(optional)</span></label><input type="text" id="bssid" placeholder="xx:xx:xx:xx:xx:xx"><label><input type="checkbox" id="hiddenCheck"> Hidden network</label><button onclick="connect()">Connect</button><button onclick="disconnect()" class="secondary">Disconnect</button><button onclick="forget()" class="secondary" style="background:#722">Forget</button><br><button onclick="window.location.href='/'" style="background:#333">← Back to HID</button></div><script><!--
