Aminiow/ESP32-HID-Web-Remote-Controller/ESP32-HID-Web-Remote-Controller.ino
function sendHTTP(url,timeout=10000){return new Promise((resolve,reject)=>{const t=setTimeout(()=>reject(new Error("HTTP timeout after "+timeout+"ms")),timeout);fetch(url,{cache:"no-store"}).then(res=>{clearTimeout(t);res.ok?resolve(res):reject(new Error("HTTP "+res.status+" for "+url))}).catch(err=>{clearTimeout(t);reject(err)})})}function updateStatus(){sendHTTP("/sta/status").then(r=>r.json()).then(data=>{const box=document.getElementById("statusBox");box.textContent="";if(data.connected){const s=document.createElement("span");s.className="connected";s.textContent="Connected";box.appendChild(s);box.appendChild(document.createTextNode(" to "));const ss=document.createElement("strong");ss.textContent=data.ssid||"";box.appendChild(ss);box.appendChild(document.createElement("br"));box.appendChild(document.createTextNode("IP: "+(data.ip||"")))}else{const s=document.createElement("span");s.className="disconnected";s.textContent="Disconnected";box.appendChild(s);box.appendChild(document.createTextNode(" - "+(data.error||"Idle")))}}).catch(()=>{})}setInterval(updateStatus,2000);updateStatus();let scanAttempts=0;const MAX_SCAN_ATTEMPTS=10;function scanNetworks(){const listDiv=document.getElementById("networkList");listDiv.innerHTML='<div class="scanning-msg">Scanning...</div>';sendHTTP("/sta/scan",15000).then(r=>r.json()).then(data=>{if(data&&data.scanning){listDiv.innerHTML='<div class="scanning-msg">Scanning, please wait...</div>';scanAttempts++;if(scanAttempts<MAX_SCAN_ATTEMPTS)setTimeout(scanNetworks,2000);else{listDiv.innerHTML='<div class="scanning-msg error-msg">Scan timed out.</div>';scanAttempts=0}return}if(!Array.isArray(data))throw new Error(data.error||"Invalid scan response");if(data.length===0){listDiv.innerHTML='<div class="scanning-msg">No networks found.</div>';scanAttempts=0;return}listDiv.innerHTML="";data.forEach(net=>{const item=document.createElement("div");item.className="network-item";const left=document.createElement("span");const name=document.createElement("strong");name.textContent=net.ssid||"(hidden)";left.appendChild(name);const bssid=document.createElement("span");bssid.className="bssid";bssid.textContent=" ("+(net.bssid||"")+")";left.appendChild(bssid);const right=document.createElement("span");const enc=document.createElement("span");enc.className="enc";enc.textContent=net.encryption_str||"Unknown";right.appendChild(enc);const rssi=document.createElement("span");rssi.className="rssi";rssi.textContent=" RSSI: "+net.rssi;right.appendChild(rssi);item.appendChild(left);item.appendChild(right);item.addEventListener("click",()=>{selectNetwork(net.ssid||"",net.bssid||"")});listDiv.appendChild(item)});scanAttempts=0}).catch(err=>{listDiv.innerHTML='<div class="scanning-msg error-msg">Error scanning. Refresh to retry.</div>';scanAttempts=0;console.error(err)})}function selectNetwork(ssid,bssid){document.getElementById("ssid").value=ssid;document.getElementById("bssid").value=bssid;document.getElementById("hiddenCheck").checked=!ssid}function connect(){const ssid=document.getElementById("ssid").value.trim(),pass=document.getElementById("pass").value,bssid=document.getElementById("bssid").value.trim(),hidden=document.getElementById("hiddenCheck").checked;if(!ssid){alert("SSID required");return}const p=new URLSearchParams();p.append("ssid",ssid);p.append("pass",pass);p.append("hidden",hidden?"1":"0");if(bssid)p.append("bssid",bssid);sendHTTP("/sta/connect?"+p.toString()).then(res=>{alert("Connecting... check status.");setTimeout(updateStatus,500)}).catch(err=>alert("Failed: "+err.message))}function disconnect(){sendHTTP("/sta/disconnect").then(()=>updateStatus()).catch(()=>{})}function forget(){if(!confirm("Forget saved WiFi credentials?"))return;sendHTTP("/sta/forget").then(()=>updateStatus()).catch(()=>{})}window.onload=function(){setTimeout(scanNetworks,500)};//--></script></body></html>
)rawliteral";
const char update_html_tpl[] PROGMEM = R"rawliteral(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1"><title>ESP32 HID - FW Update</title><style>
*{box-sizing:border-box;margin:0;padding:0}body{font-family:'Segoe UI',Roboto,sans-serif;background:#0b0b0b;color:#eee;padding:20px;min-height:100vh}.container{max-width:720px;margin:0 auto;display:flex;flex-direction:column;gap:16px}.card{background:#1e1e1e;border-radius:16px;padding:18px;border:1px solid #333;box-shadow:0 8px 20px rgba(0,0,0,.5)}h2{font-size:1.5rem;color:#5b9aff;text-align:center;margin-bottom:10px;font-weight:300;letter-spacing:1px}h3{font-size:1.1rem;color:#aaa;text-align:center;margin:18px 0 10px;font-weight:400}button{padding:8px 16px;background:#2a2a2a;color:#eee;border:1px solid #444;border-radius:8px;cursor:pointer;font-size:14px;font-weight:500;transition:.15s;user-select:none;-webkit-user-select:none}button:hover{background:#3a3a3a}button:active{background:#444}button:disabled{opacity:.5;cursor:not-allowed}button.accent{background:#2c5f8a;border-color:#3a7bbd}button.accent:hover{background:#3a7bbd}button.back{background:#333}button.warn{background:#7a4a3a;border-color:#a05a4a}input[type=text]{background:#222;border:1px solid #444;border-radius:8px;padding:8px 14px;color:#eee;font-size:14px;flex:1;min-width:180px;outline:none}input[type=text]:focus{border-color:#5b9aff}input[type=file]{background:#222;border:1px solid #444;border-radius:8px;padding:6px;color:#eee;font-size:14px;max-width:100%}.small{font-size:12px;color:#777;text-align:center;margin-top:6px}.url-row{display:flex;flex-wrap:wrap;gap:10px;justify-content:center;align-items:center;margin:6px 0}.btn-group{display:flex;flex-wrap:wrap;gap:8px;justify-content:center;margin:8px 0}.status{text-align:center;padding:10px;color:#aaa;background:#141414;border-radius:8px;margin:10px 0;border-left:3px solid #555}.status.up-to-date{border-left-color:#2ecc71;color:#2ecc71}.status.available{border-left-color:#f39c12;color:#f39c12}.status.progress{border-left-color:#5b9aff;color:#5b9aff}.status.error{border-left-color:#e74c3c;color:#e74c3c}.time-row{display:flex;flex-wrap:wrap;gap:10px;justify-content:space-between;align-items:center;background:#1a1a1a;padding:10px 14px;border-radius:8px;margin:10px 0;font-size:13px;color:#aaa;border-left:3px solid #444}.time-row select{background:#222;color:#eee;border:1px solid #444;border-radius:6px;padding:4px 8px;font-size:13px}.log-panel{background:#121212;border:1px solid #333;border-radius:8px;padding:10px;max-height:220px;overflow-y:auto;margin-top:10px;font-family:monospace;font-size:12px;white-space:pre-wrap;word-wrap:break-word;color:#b0c4de}.progress-wrap{width:100%;background:#181818;border:1px solid #333;border-radius:8px;height:16px;margin:10px 0;overflow:hidden}.progress-fill{height:100%;background:linear-gradient(90deg,#2c5f8a,#5b9aff);width:0%;transition:width .25s ease}.progress-text{text-align:center;font-size:12px;color:#aaa;margin-bottom:6px}
</style></head><body><div class="container"><div class="card"><h2>⚙️ Firmware Update</h2><div id="updateStatus" class="status">Loading status...</div><div class="time-row"><span id="uptime">⏱ Uptime: --</span><span id="utcTime">🌐 UTC: --</span><span id="localTime">🏠 Local: --</span><span><label>Timezone: </label><select id="tzSelect"><option value="0">UTC</option><option value="3.5" selected>UTC+3:30 (Iran)</option><option value="1">UTC+1</option><option value="2">UTC+2</option><option value="3">UTC+3</option><option value="4">UTC+4</option><option value="5.5">UTC+5:30</option><option value="8">UTC+8</option><option value="-5">UTC-5</option><option value="-8">UTC-8</option></select><input type="text" id="tzCustom" placeholder="or ±HH:MM" style="background:#222;border:1px solid #444;border-radius:6px;padding:4px 8px;color:#eee;font-size:13px;max-width:140px"></span></div><h3>Secure OTA (Root CA + Insecure fallback)</h3><div class="btn-group"><button class="accent" id="otaSecureBtn">🔒 Start Secure OTA</button><button class="warn" id="otaInsecureBtn" style="display:none">⚠️ Retry Insecurely</button></div><h3>Network</h3><div class="url-row"><input type="text" id="ntp1" placeholder="NTP 1"><input type="text" id="ntp2" placeholder="NTP 2"><input type="text" id="ntp3" placeholder="NTP 3"><button onclick="saveNtp()">Save NTP</button></div><div class="url-row"><input type="text" id="mdnsName" placeholder="mDNS name (esp32-mouse)"><input type="text" id="mdnsDom" placeholder="domain (local)"><button onclick="saveMdns()">Save mDNS</button></div><div class="progress-text" id="otaProgressText">Idle</div><div class="progress-wrap"><div class="progress-fill" id="otaProgressFill"></div></div><div id="otaLog" class="log-panel">Waiting for OTA...</div><div class="small">Downloads firmware.bin from the configured Firmware URL, validates the TLS chain, and flashes on the fly.</div><h3>Auto Update (from URL)</h3><div class="url-row"><input type="text" id="verUrl" placeholder="Version URL"><input type="text" id="binUrl" placeholder="Firmware URL"><button onclick="saveUrls()">Save URLs</button></div><div class="btn-group"><button class="accent" onclick="checkUpdate()">Check for Update</button></div><div class="small" id="versionDisplay">Current version: loading...</div><h3>Manual Upload</h3><form id="uploadForm" enctype="multipart/form-data" method="POST" action="/upload" style="display:flex;flex-wrap:wrap;gap:10px;justify-content:center;align-items:center"><input type="file" name="firmware" accept=".bin"><input type="text" name="hash" placeholder="SHA-256 (optional, 64 hex chars)" style="flex:1;min-width:280px" maxlength="64" pattern="[0-9a-fA-F]{64}"><button class="accent" type="submit">Upload &amp; Update</button></form><div class="small">Paste the SHA-256 from <code>version.txt</code> to verify integrity. Leave empty to skip verification.</div><div class="small">Upload a local .bin to flash directly. Device reboots on success.</div></div><div class="card"><div class="btn-group"><button class="back" onclick="window.location.href='/'">← Back to HID</button><button class="back" onclick="window.location.href='/sta'">📶 WiFi Settings</button><button class="back" onclick="window.location.href='/logs'">📄 Raw Logs</button></div></div></div><script><!--
const DEFAULT_VER_URL="__VER_URL__",DEFAULT_BIN_URL="__BIN_URL__";let latestNewVersion="",lastUtcTimestamp=null;function sendHTTP(url,timeout=15000){return new Promise((resolve,reject)=>{const t=setTimeout(()=>reject(new Error("HTTP timeout after "+timeout+"ms")),timeout);fetch(url,{cache:"no-store"}).then(res=>{clearTimeout(t);res.ok?resolve(res):reject(new Error("HTTP "+res.status+" for "+url))}).catch(err=>{clearTimeout(t);reject(err)})})}function loadCurrentUrls(){fetch("/get_urls",{cache:"no-store"}).then(res=>res.json()).then(data=>{document.getElementById("verUrl").value=data.verUrl||DEFAULT_VER_URL;document.getElementById("binUrl").value=data.binUrl||DEFAULT_BIN_URL}).catch(()=>{document.getElementById("verUrl").value=DEFAULT_VER_URL;document.getElementById("binUrl").value=DEFAULT_BIN_URL})}function saveUrls(){const ver=document.getElementById("verUrl").value.trim(),bin=document.getElementById("binUrl").value.trim();if(!ver||!bin){alert("Both URLs required");return}sendHTTP("/set_urls?ver="+encodeURIComponent(ver)+"&bin="+encodeURIComponent(bin)).then(()=>alert("URLs saved")).catch(err=>alert("Failed to save URLs: "+err.message))}function checkUpdate(){sendHTTP("/check_update").then(()=>{alert("Update check started.");setTimeout(checkUpdateStatus,1000)}).catch(err=>alert("Failed to start update check: "+err.message))}function checkUpdateStatus(){fetch("/update_status",{cache:"no-store"}).then(res=>res.json()).then(data=>{const s=document.getElementById("updateStatus");s.classList.remove("up-to-date","available","progress","error");if(data.inProgress||data.otaRunning){s.classList.add("progress");s.textContent="⏳ Update in progress...";return}if(data.available){latestNewVersion=data.new||"";s.classList.add("available");s.textContent="";const sp=document.createElement("span");sp.textContent="⚠️ New version "+(data.new||"?")+" available!  ";s.appendChild(sp);const b=document.createElement("button");b.className="accent";b.textContent="Trigger URL Update";b.addEventListener("click",triggerUpdate);s.appendChild(b)}else{s.classList.add("up-to-date");s.textContent="✅ Up to date ("+(data.current||"?")+")"}}).catch(()=>{})}function triggerUpdate(){if(!confirm("Update to version "+latestNewVersion+"? The device will reboot."))return;sendHTTP("/trigger_update").then(()=>alert("Update started. Device will reboot shortly.")).catch(err=>alert("Update trigger failed: "+err.message))}function updateVersionDisplay(){fetch("/update_status",{cache:"no-store"}).then(res=>res.json()).then(data=>{const v=data.current||"?";document.getElementById("versionDisplay").textContent="Current version: "+v;document.title="ESP32 HID Controller v"+v+" - Update"}).catch(()=>{})}const otaLogDiv=document.getElementById("otaLog"),otaSecureBtn=document.getElementById("otaSecureBtn"),otaInsecureBtn=document.getElementById("otaInsecureBtn");let evtSource=null;function appendOtaLog(m){otaLogDiv.textContent+=m+"\n";otaLogDiv.scrollTop=otaLogDiv.scrollHeight}function startOta(mode){const ep=mode==="insecure"?"/start_ota_insecure":"/start_ota_secure";otaSecureBtn.disabled=true;otaInsecureBtn.style.display="none";otaLogDiv.textContent="";document.getElementById("otaProgressFill").style.width="0%";document.getElementById("otaProgressText").textContent="Starting...";sendHTTP(ep).then(()=>appendOtaLog("OTA request sent ("+mode+").")).catch(err=>{appendOtaLog("Failed: "+err.message);otaSecureBtn.disabled=false})}otaSecureBtn.addEventListener("click",()=>startOta("secure"));otaInsecureBtn.addEventListener("click",()=>startOta("insecure"));function connectSSE(){if(evtSource)evtSource.close();evtSource=new EventSource("/events");evtSource.addEventListener("log",e=>appendOtaLog(e.data));evtSource.addEventListener("ota_state",e=>{if(e.data==="running"){otaSecureBtn.disabled=true;otaInsecureBtn.style.display="none";appendOtaLog("OTA running...")}else if(e.data==="insecure_offer"){otaSecureBtn.disabled=false;otaInsecureBtn.style.display="inline-block";appendOtaLog("Secure method failed. You may retry insecurely.")}else if(e.data==="failed"){otaSecureBtn.disabled=false;appendOtaLog("OTA failed.")}else if(e.data==="rebooting"){appendOtaLog("Rebooting...")}});evtSource.addEventListener("progress",e=>{try{const d=JSON.parse(e.data);document.getElementById("otaProgressFill").style.width=d.pct+"%";document.getElementById("otaProgressText").textContent=d.pct+"% ("+(d.written/1024).toFixed(0)+" / "+(d.total/1024).toFixed(0)+" KB)"}catch(_){}});evtSource.addEventListener("time",e=>{try{const d=JSON.parse(e.data);document.getElementById("uptime").textContent="⏱ Uptime: "+d.uptime;document.getElementById("utcTime").textContent="🌐 UTC: "+d.utc;if(d.utcTimestamp>0){lastUtcTimestamp=d.utcTimestamp;renderLocalTime()}}catch(_){}});evtSource.onerror=()=>setTimeout(connectSSE,3000)}function parseCustomOffset(s){const m=s.trim().match(/^([+-]?)(\d{1,2})(?::(\d{2}))?$/);if(!m)return null;const sign=m[1]==="-"?-1:1,h=parseInt(m[2],10),mn=m[3]?parseInt(m[3],10):0;return sign*(h+mn/60)}function currentOffset(){const c=parseCustomOffset(document.getElementById("tzCustom").value);return c!==null?c:parseFloat(document.getElementById("tzSelect").value)}function renderLocalTime(){if(lastUtcTimestamp===null)return;const d=new Date(lastUtcTimestamp*1000),offset=currentOffset(),local=new Date(d.getTime()+offset*3600000),iso=local.toISOString().replace("T"," ").slice(0,19),hh=Math.floor(Math.abs(offset)),mm=Math.round((Math.abs(offset)-hh)*60);document.getElementById("localTime").textContent="🏠 Local: "+iso+" (UTC"+(offset>=0?"+":"-")+String(hh).padStart(2,"0")+":"+String(mm).padStart(2,"0")+")"}document.getElementById("tzSelect").addEventListener("change",()=>{document.getElementById("tzCustom").value="";renderLocalTime()});document.getElementById("tzCustom").addEventListener("input",renderLocalTime);loadCurrentUrls();function autoFillHash(){const f=document.querySelector('input[name="hash"]');if(!f||f.value)return;fetch("/update_status",{cache:"no-store"}).then(r=>r.json()).then(d=>{if(d.hash&&d.hash.length===64){f.value=d.hash;f.title="Auto-filled from version server"}}).catch(()=>{})}window.addEventListener("load",()=>setTimeout(autoFillHash,500));updateVersionDisplay();checkUpdateStatus();setInterval(checkUpdateStatus,15000);let staOnline=false;function checkOnline(){fetch("/sta/status",{cache:"no-store"}).then(r=>r.json()).then(d=>{staOnline=!!d.connected;document.querySelectorAll("#otaSecureBtn,#otaInsecureBtn,#uploadForm button").forEach(b=>b.disabled=!staOnline);if(!staOnline){document.getElementById("updateStatus").textContent="🔌 STA not connected - connect to Wi-Fi first.";document.getElementById("updateStatus").className="status error"}}).catch(()=>{})}window.onload=function(){checkOnline();setInterval(checkOnline,4000);connectSSE();loadNetCfg();updateVersionDisplay();checkUpdateStatus();setInterval(checkUpdateStatus,15000)};document.getElementById("uploadForm").addEventListener("submit",e=>{if(!staOnline){e.preventDefault();alert("STA not connected.")}});function loadNetCfg(){fetch("/get_settings",{cache:"no-store"}).then(r=>r.json()).then(s=>{document.getElementById("ntp1").value=s.ntp1||"";document.getElementById("ntp2").value=s.ntp2||"";document.getElementById("ntp3").value=s.ntp3||"";document.getElementById("mdnsName").value=s.mdnsName||"";document.getElementById("mdnsDom").value=s.mdnsDom||""})}function saveNtp(){const p=new URLSearchParams();p.append("s1",document.getElementById("ntp1").value.trim());p.append("s2",document.getElementById("ntp2").value.trim());p.append("s3",document.getElementById("ntp3").value.trim());fetch("/set_ntp?"+p).then(()=>alert("NTP saved")).catch(e=>alert("err "+e))}function saveMdns(){const p=new URLSearchParams();p.append("name",document.getElementById("mdnsName").value.trim());p.append("domain",document.getElementById("mdnsDom").value.trim());fetch("/set_mdns?"+p).then(()=>alert("mDNS saved (device reconnect may be needed)")).catch(e=>alert("err "+e))}window.addEventListener("beforeunload",()=>{try{if(evtSource)evtSource.close()}catch(e){}});//--></script></body></html>
)rawliteral";
String buildUpdateHtml() {
  String html = FPSTR(update_html_tpl);
  html.replace("__VER_URL__", DEFAULT_VER_URL);
  html.replace("__BIN_URL__", DEFAULT_BIN_URL);
  return html;
}
void handleUpdatePage() {
  server.send(200, "text/html", buildUpdateHtml());
}
void handleRoot() {
  server.send(200, "text/html", index_html);
}
void handleSTA() {
  server.send(200, "text/html", sta_html);
}
void handleGetUpdateUrls() {
  String json = "{";
  json += "\"verUrl\":\"" + jsonEscape(updateVersionUrl) + "\",";
  json += "\"binUrl\":\"" + jsonEscape(updateBinUrl) + "\"";
  json += "}";
  server.send(200, "application/json", json);
}
void setup() {
  Serial.begin(115200);
  LOG_INFO("ESP32 HID Controller v%s starting...", FW_VERSION_STR);
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  USB.manufacturerName("ESP32-Remote-HID");
  USB.productName("ESP32-Remote-HID");
  USB.serialNumber(String((uint32_t)ESP.getEfuseMac(), HEX).c_str());
#endif
  USB.begin();
  Keyboard.begin();
  Mouse.begin();
  ConsumerControl.begin();
  LOG_INFO("USB HID initialised (Keyboard, Mouse, ConsumerControl)");
  checkHardwareRequirements();
  printCurrentAppPartition();
  loadSettings();
  loadUpdateUrls();
  WiFi.mode(WIFI_AP);
  int bestChannel = selectBestChannel();
  LOG_INFO("Selected Wi‑Fi channel: %d", bestChannel);
  WiFi.softAP(ap_ssid, ap_password, bestChannel, true);
  IPAddress apIP = WiFi.softAPIP();
  LOG_INFO("AP mode started, IP: %s", apIP.toString().c_str());
  if (MDNS.begin(mdnsHostname.c_str())) {
    MDNS.addService("http", "tcp", 80);
    LOG_INFO("mDNS started: esp32-hid.local");
  } else LOG_WARN("mDNS failed");
  configTime(0, 0, ntpServer1.c_str(), ntpServer2.c_str(), ntpServer3.c_str());
  LOG_INFO("NTP configured (attempting sync in background)");
  applyTxPower();
  applyPowerSave();
  dnsServer.start(53, "*", apIP);
  WiFi.onEvent(WiFiEvent);
  server.on("/", handleRoot);
  server.on("/move", handleMove);
  server.on("/click", handleClick);
  server.on("/double", handleDoubleClick);
  server.on("/down", handleDown);
  server.on("/up", handleUp);
  server.on("/wheel", handleWheel);
  server.on("/set_sensitivity", handleSetSensitivity);
  server.on("/set_repeat", handleSetRepeatInterval);
  server.on("/set_legacy", handleSetLegacyMode);
  server.on("/set_bootproto", handleSetBootProtocol);
  server.on("/set_gyro", handleSetGyro);
  server.on("/set_txpower", handleSetTxPower);
  server.on("/set_psave", handleSetPowerSave);
  server.on("/consumer", handleConsumer);
  server.on("/type", handleType);
  server.on("/key", handleKeyTap);
  server.on("/key_down", handleKeyDown);
  server.on("/key_up", handleKeyUp);
  server.on("/toggle_modifier", handleToggleModifier);
  server.on("/reset_modifiers", handleResetModifiers);
  server.on("/sta", handleSTA);
  server.on("/sta/status", handleSTAStatus);
  server.on("/sta/scan", handleSTAScan);
  server.on("/sta/connect", handleSTAConnect);
  server.on("/sta/disconnect", handleSTADisconnect);
  server.on("/sta/forget", handleSTAForget);
  server.on("/logs", handleLogs);
  server.on("/set_urls", handleSetUpdateUrls);
  server.on("/check_update", handleCheckUpdate);
  server.on("/update_status", handleUpdateStatus);
  server.on("/trigger_update", handleTriggerUpdate);
  server.on(
    "/upload", HTTP_POST, []() {
      server.send(uploadOk ? 200 : 500, "text/plain", uploadMsg);
      if (uploadOk) {
        delay(1000);
        ESP.restart();
      }
    },
    handleUpload);
  server.on("/get_urls", handleGetUpdateUrls);
  server.on("/update", handleUpdatePage);
  server.on("/events", handleEvents);
  server.on("/start_ota_secure", handleStartOtaSecure);
  server.on("/start_ota_insecure", handleStartOtaInsecure);
  server.on("/get_settings", handleGetSettings);
  server.on("/set_ntp", handleSetNtp);
  server.on("/set_mdns", handleSetMdns);
  server.onNotFound([apIP]() {
    server.sendHeader("Location", "http://" + apIP.toString() + "/", true);
    server.send(302, "text/plain", "");
  });
  server.begin();
  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
  LOG_INFO("Setup complete.");
  staStarted = true;
  loadSTAConfig();
  if (WiFi.status() == WL_CONNECTED) checkAndUpdate();
}
void loop() {
  dnsServer.processNextRequest();
  server.handleClient();
  webSocket.loop();
  if (!staStarted && millis() > 5000UL) {
    staStarted = true;
    LOG_INFO("Delayed STA connection starting...");
    loadSTAConfig();
  }
  if (connecting && WiFi.status() != WL_CONNECTED) {
    if (millis() - connectStartTime >= CONNECT_TIMEOUT) {
      connecting = false;
      if (sta_retry_count < MAX_RETRIES) {
        sta_retry_count++;
        retryPending = true;
        lastRetryTime = millis();
        sta_status = "Retrying...";
        sta_error = "Retry " + String(sta_retry_count) + "/" + String(MAX_RETRIES) + " in " + String(RETRY_INTERVAL / 1000) + "s";
        WiFi.disconnect();
        LOG_WARN("STA timeout; retry %d/%d scheduled in %lu ms", sta_retry_count, MAX_RETRIES, RETRY_INTERVAL);
      } else {
        retryPending = false;
        sta_status = "Disconnected";
        sta_error = "Max retries exceeded";
        WiFi.disconnect();
        LOG_ERROR("STA max retries exceeded");
      }
    }
  }
  if (retryPending && !connecting && WiFi.status() != WL_CONNECTED) {
    unsigned long backoffDelay = RETRY_BACKOFF[min(sta_retry_count, (int)MAX_RETRIES - 1)];
    if (millis() - lastRetryTime >= backoffDelay) {
      retryPending = false;
      preferences.begin("wifi", true);
      String ssid = preferences.getString("ssid", "");
      String pass = preferences.getString("pass", "");
      bool hidden = preferences.getBool("hidden", false);
      String bssid = preferences.getString("bssid", "");
      preferences.end();
      if (!ssid.isEmpty()) {
        retryPending = false;
        connectSTA(ssid, pass, hidden, bssid, false);
      } else {
        retryPending = false;
        connecting = false;
        sta_status = "Disconnected";
        sta_error = "No saved credentials";
        LOG_ERROR("No saved credentials for retry");
      }
    }
  }
  static unsigned long lastUpdateCheck = 0;
  if (WiFi.status() == WL_CONNECTED && millis() - lastUpdateCheck > 86400000UL) {
    lastUpdateCheck = millis();
    xTaskCreatePinnedToCore(checkUpdateTask, "dailyCheck", 8192, NULL, 1, NULL,
                            CONFIG_ARDUINO_RUNNING_CORE);
  }
  if (sseClient && !sseClient->connected()) {
    sseClient->stop();
    delete sseClient;
    sseClient = NULL;
  }
  static unsigned long lastTimePush = 0;
  if (sseClient && sseClient->connected() && millis() - lastTimePush > 1000) {
    lastTimePush = millis();
    sendTimeUpdate();
  }
  checkIdleSleep();
  if (staSaveChannel && WiFi.status() == WL_CONNECTED) {
    staSaveChannel = false;
    uint8_t ch = 0;
    wifi_second_chan_t second;
    esp_wifi_get_channel(&ch, &second);
    if (ch > 0) {
      preferences.begin("wifi", false);
      preferences.putInt("lastChan", (int)ch);
      preferences.end();
      LOG_INFO("Saved STA channel: %d", ch);
    }
  }
  delay(1);
}
